{"_id":{"$oid":"59efa8c74410c200121e66cd"},"author":"Mike Keppler","title":"Overwatch Meta Report","body":"Here's an update of what the current pick-rate of heroes are in the Overwatch pro scene (provided by reddit user /u/ Falcon_Kick.  With her recent buff, Mercy has finally taken over the lead spot as the most picked hero from the roster while the previous leader, Lucio, has fallen down to 13%. My biggest concern regarding the meta is many of the available heroes don't see much light in professional play. This makes many matches somewhat boring to watch since the same heroes are often chosen. I understand a few heroes will always stand above the rest, but it would be great if Blizzard could improve the rest of them so they could achieve a ~20% usage rate.\r\n\r\nS Tier (\u003e=95% Usage Rate): Mercy (95%)\r\n \r\nTier 1 (\u003e80% Usage Rate): D.Va (88%), Zenyatta (82%), Tracer (80%)\r\n \r\nTier 2 (\u003e50% Usage Rate): Winston (71%)\r\n \r\nTier 3 (\u003e20% Usage Rate): Genji (30%), Soldier 76 (26%), Roadhog (21%), McCree (20%)\r\n \r\nTier 4 (\u003e5% Usage Rate): Widowmaker (16%), Pharah (15%), Lucio (13%), Orisa (7%), Reinhardt (7%), Ana (6%), Zarya (5%)\r\n \r\nTier 5 (\u003c5% Usage Rate): Doomfist (4%), Reaper (4%), Sombra (3%), Junkrat (2%), Torbjorn (2%), Bastion (1%), Mei (1%), Hanzo (0%), Symmetra (0%)","image":"https://i.imgur.com/66pcQoX.jpg","imageCaption":"Mercy","imageSource":"","sourceLink":"https://www.reddit.com/r/Overwatch/comments/78gbb0/overwatch_pro_scene_meta_report_lord_have_mercy/","categories":["Overwatch"],"published":{"$date":"2017-10-24T00:00:00.000Z"},"__v":0,"contentType":"standard"}
{"_id":{"$oid":"59efcf4181afd200121176cb"},"author":"Nate Chrisman","title":"EVO 2018 Trailer Drops @ 12PM Tomorrow ","body":"Head Honcho of EVO, Joey Cuellar, tweeted today at noon that the new EVO 2018 trailer is going to be dropping \"in exactly 24 hours\" from when he tweeted. That leaves us waiting until 12PM on October 25 to see what EVO 2018 is all about. \r\n\r\nWith EVO Japan just around the corner, happening on January 26-28 of 2018, this trailer is coming out just in time to hype up another year of FGC competitions to look forward to. \r\n\r\n\u003chr\u003e\r\n    \u003cimg src='https://i.imgur.com/Om6sy0b.png'\u003e\r\n\u003chr\u003e\r\n\r\nBe sure to keep a look out on EST for the trailer when it's released. Also give \u003ca href='https://twitter.com/MrWiz'\u003eJoey Cuellar a follow on Twitter\u003c/a\u003e and give him a shout out for being the man to bring us one of the greatest yearly events for the FGC! Here's the EVO Japan 2018 Trailer while you wait! \r\n\r\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/WIil6IIEyQY\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e","image":"https://i.imgur.com/tsjCCEE.jpg","imageCaption":"EVO Logo","imageSource":"evo.shoryuken.com","sourceLink":"https://twitter.com/MrWiz/status/922900682352377856","categories":["Street Fighter V"],"published":{"$date":"2017-10-24T00:00:00.000Z"},"__v":0}
{"_id":{"$oid":"59f0e047b5ea62001283d5eb"},"author":"Nate Chrisman","title":"Here is the EVO 2018 Trailer That We've All Been Waiting For","body":"As promised, Mr. Cuellar has given us the 2018 trailer for EVO. It looks like we have another year of growth and excitement for the FGC! \r\n\r\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Lf_Y1DaeJHk?rel=0\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e","image":"https://i.imgur.com/yOXzxed.png","imageCaption":"EVO Logo","imageSource":"evo.shoryuken.com","sourceLink":"https://www.youtube.com/watch?v=Lf_Y1DaeJHk","contentType":"video","categories":["Street Fighter V"],"published":{"$date":"2017-10-25T18:45:36.000Z"},"__v":0}
{"_id":{"$oid":"59f9e3952f99a6001278a38b"},"author":"Nate Chrisman","title":"Comcast Spectator Announces 'Philadelphia Fusion' Team for Overwatch League","body":"Owner of the Philadelphia Flyers, Comcast Spectator, has opted in for the Overwatch League with the hefty $20 million per team franchise. Much like many of the other investors in the Overwatch League, this is Comcast Spectator's first eSports venture, but they are certainly no stranger to sports in general. That's because Comcast Spectator is an entirely sports-based organization. \r\n\r\nFounded in 1974, the organization has over 40 years of experience in the industry managing not only sports teams, but also arenas (such as the Wells Fargo Center) and sports broadcasting networks (previously owned Comcast SportsNet regional sports networks). \r\n\r\nIt's no surprise that they are going to be added to the ranks of the many other investors in Overwatch League who are sports \u0026 business aficionados. So far, the list goes like this (from \u003ca href='https://en.wikipedia.org/wiki/Overwatch_League#Teams'\u003eWiki\u003c/a\u003e) : \r\n\r\n\u003ch3\u003eOverwatch League Teams \u0026 Owners as of 11/1/2017\u003c/h3\u003e\r\n\r\nBoston Uprising (Robert Kraft / New England Patriots)\r\nDallas Fuel (Team Envy)\r\nHouston Outlaws (OpTic Gaming)\r\nLondon Spitfire (Jack Etienne / Cloud 9)\r\nLA Valiant (Noah Whinston / Immortals)\r\nNY Excelsior (Jeff Wilpon / NY Mets)\r\nSan Francisco Shock (Andy Miller / NRG ESports)\r\nSeoul Dynasty (Kevin Chou / Kabam)\r\nShanghai Dragons (NetEase)\r\n\r\nThe Overwatch League's first full season begins on January 18, 2018. Be Ready!","sourceLink":"","image":"https://i.imgur.com/51NLd8k.jpg","imageCaption":"Philadelphia Fusion","imageSource":" Philadelphia Fusion, Blizzard Entertainment","contentType":"standard","categories":["general","Overwatch"],"published":{"$date":"2017-11-01T15:09:09.138Z"},"__v":0}
{"_id":{"$oid":"59fa89e3aec21d0012ff747d"},"author":"Nate Chrisman","title":"IOC Wants eSports Treated the Same as Traditional Sports... and They Should","body":"Not more than two months ago, news had become known about the International Olympic Committee (IOC) taking eSports into consideration for future olympic games. Despite the Asian Games in Hangzhou in 2022 including eSports, the president of the IOC, Thomas Bach, still wants to proceed with caution and not promise too much in terms of acceptance into future games. \r\n\r\nIt seemed that the main concerns fall in the realms of:\r\n\r\n1. A complete regulatory organization\r\n2. Content of the games that would be played\r\n\r\nIn terms of wanting a complete regulatory organization, that is entirely understandable. Bach had \u003ca href='http://www.scmp.com/news/china/society/article/2108501/violent-video-games-have-no-place-olympics-e-sports-are-still'\u003esaid himself that\u003c/a\u003e “You have to have somebody who is guaranteeing you that these athletes doing video sports games are not doped, that they are following technical rules, that they are respecting each other.” This is entirely reasonable when you would be talking not only about Olympic level competition in sports, but also in any competition that requires the entrants are held to the highest standard. \r\n\r\nThe recent Olympic Summit, which was held on October 28, 2017, dedicated part of their time to talking about eSports. From the \u003ca href='https://www.olympic.org/news/communique-of-the-olympic-summit'\u003eolympic.org\u003c/a\u003e website, there are a few important things to note that were said that show progress on this front:\r\n\r\n\u003cul\u003e\r\n  \u003cli\u003eeSports are showing strong growth, especially within the youth demographic across different countries, and can provide a platform for engagement with the Olympic Movement.\u003c/li\u003e\r\n  \u003cli\u003eCompetitive \"eSports\" could be considered as a sporting activity, and the players involved prepare and train with an intensity which may be comparable to athletes in traditional sports. \u003c/li\u003e\r\n\u003cli\u003eIn order to be recognised by the IOC as a sport, the content of \"eSports\" must not infringe on the Olympic values. \u003c/li\u003e\r\n\u003cli\u003eA further requirement for recognition by the IOC must be the existence of an organisation guaranteeing compliance with the rules and regulations of the Olympic Movement (anti-doping, betting, manipulation, etc.).\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\nAs for the content of the games, that might be a more difficult thing to regulate seeing as they are trying to capture a younger demographic as a result of eSports inclusion. There have been talks of only including games that are analogous to traditional sports (such as basketball, football, etc.), which do not contain any violence, mature content, etc. This, they have said, would be more in line with the Olympic values. \r\n\r\nHowever, it does still seem like they are starting to change their opinion more as time goes on. Even if eSports do not end up being included in the Olympic Games by the IOC, it doesn't seem that it would inhibit the eSports industry's growth. ","sourceLink":"","image":"https://i.imgur.com/LDhWN2S.jpg","imageCaption":"Olympic Flag","imageSource":"olympic.org","contentType":"standard","categories":["general"],"published":{"$date":"2017-11-02T02:58:43.901Z"},"__v":0}
{"_id":{"$oid":"59fb35ad24a13e00121759c5"},"author":"Nate Chrisman","title":"Street Fighter OG Infiltration Joins Team Grapht","body":"Team Grapht and Infiltration joined forces as of November 1, providing a new chapter in his life. The 32 year old Korean Street Fighter player is no stranger to top notch sponsors. He is still currently sponsored by Monster Energy and will continue to receive support from Razer as he continues down his new path. He also has partnered with Mad Catz and Western Wolves in the past. \r\n\r\n\u003chr\u003e\r\n\u003ca href='https://twitter.com/TeamRazer/status/925966657461161984' target='_blank'\u003e\u003cimg src='https://i.imgur.com/hzTx0kJ.png'\u003e\u003c/a\u003e\r\n\u003chr\u003e\r\n\r\nThe four-time EVO champion has many notable victories on his CV and is consistently recognized as one of the best Street Fighter players in the community. \r\n\r\nTeam Grapht is also not averse to providing professional eSports athletes in not only fighting games, but MOBA's and racing games as well. Infiltration will be along side other FGC favorites like Fuudo, MOV,, Haitani, Yukadon, and Gllty for Street Fighter as well as Takumi for MVCi. \r\n\r\nWe're excited to see Infiltration's new partnership with Team Grapht unfold as 2018 begins shortly. ","sourceLink":"http://gographt.com/grpt/","image":"https://i.imgur.com/87uCeMe.png","imageCaption":"Infiltration","imageSource":"gographt.com","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-02T15:11:41.401Z"},"__v":0}
{"_id":{"$oid":"59fb8ea92d5cb800126f4c95"},"author":"Nate Chrisman","title":"Players Receive Lifetime Ban from Canada Cup","body":"On one of the final stops for the CPT this year, Canada Cup in Toronto ran into some issues regarding the Marvel vs. Capcom: Infinite competition. According to Canada Cup representatives, \"Quackbot\" (Jose Aldape), who also goes by PC Marvel God, had entered the tournament twice, first under his original alias, and then under another player's alias after being eliminated. The second player involved was \"Holy Order Troll\" (Lina Crawford), who had given her spot to him as a result of an apparent stick malfunction. \r\n\r\nThis had caused many matches to be replayed in the bracket in order to remedy the issue. Quackbot issued an apology on Twitter for what happened.\r\n\r\n\u003chr\u003e\r\n\u003ca href='https://twitter.com/PCMarvelGod/status/924453441589702656'\u003e\u003cimg src='https://i.imgur.com/OkP6Cfh.png'\u003e\u003c/a\u003e\r\n\u003chr\u003e\r\n\r\nA statement released by Canada Cup officials states that \"With no prior precedent of this in our community, Tournament Organizers were required to make a judgement call quickly for all players impacted\". The decision that was made resulted in both players being banned from the event indefinitely. Canada Cup officials concluded the statement by saying\r\n\r\n\"Players who misrepresent themselves under another player’s gamertag or multiple gamertags (with and without consent) undermine the legitimacy of tournament events, and are in violation of the rules.\"\r\n\r\nYou can read the full statement made by Canada Cup officials by following the source link below.","sourceLink":"http://canada-cup.ca/","image":"https://i.imgur.com/Z9iCkzU.png","imageCaption":"Canada Cup","imageSource":"http://canada-cup.ca","contentType":"standard","categories":["general","Marvel vs. Capcom: Infinite"],"published":{"$date":"2017-11-02T21:31:21.501Z"},"__v":0}
{"_id":{"$oid":"59fbcb274bbcb500123388c2"},"author":"Mike Keppler","title":"Overwatch Spectator Mode Enhancements","body":"Spectating in Overwatch is getting some new features which should allow for a more enjoyable spectator experience. One of the biggest gripes I've had with watching Overwatch is it felt way too chaotic.  It felt like the viewer never had a good view of all the action happening around them and it was difficult to figure out which team one was looking at.  With the new updates incoming (just in time for the Overwatch World Cup) most, if not all of those complaints will be erased.\r\n\r\nTeams will now be required to use team colors making it easier for spectators to determine who is who without issue. Commentators  will also have access to a bird eye view of the map so viewers can see all the heroes moving in real time in a strategic view. This will help the commentators provide better feedback of what's happening in the game to enhance the spectating experience.\r\n\r\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/AUPExXBfS1s?rel=0\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\n\r\nA smarter camera is going to be in place which will auto-detect where all the action is happening.  The camera view is an \"over-the-shoulder\" of the player being spectated giving the spectator a much wider area to view. Of course the smart camera isn't going to catch everything which provides a perfect reason to use the newly included replay feature! Whenever a big play happens duringa game, commentators will now be able to replay a segment of gameplay at a normal or slower speed to break down gameplay piece by piece. Lastly, real-time stat tracking will be provided for all players so people can determine who really is the best of the best.\r\n\r\nI'm sure the implementation of these tools won't be perfect when they launch but it sounds like a really solid foundation for Blizzard to build upon as Overwatch grows bigger as an esport.","sourceLink":"https://www.youtube.com/embed/AUPExXBfS1s?rel=0","image":"https://i.imgur.com/iKidZtr.jpg","imageCaption":"Overwatch World Cup","imageSource":"blizzard.com","contentType":"standard","categories":["general","Overwatch"],"published":{"$date":"2017-11-03T01:49:27.074Z"},"__v":0}
{"_id":{"$oid":"59fc95fafe41f800122eab4e"},"author":"Nate Chrisman","title":"Being an Esports Athlete Isn't Always Easy - Mew2King's Mental Health Struggle","body":"Looking up the definition of “sport” says: “an activity involving physical exertion and skill in which an individual or team competes against another or others for entertainment.” So where is all of the exertion coming from in esports? It’s mental. That’s not to say that traditional sports don’t require mental strength and dexterity, but esports faces a more defined obstacle in the world of mental health as it becomes more of a mainstream activity and fruitful career opportunity. \r\n\r\nA recent example of this is Jason Zimmerman, who needs no introduction as Mew2King, the most decorated Super Smash Bros. player in esports history with a staggering 70 tournament wins to date. A member of Team Echo Fox, which has some of the most notable esports athletes on their roster, he is no doubt a superstar. \r\n\r\nZimmerman spoke with ESPN recently about experiencing depression throughout the recent past and what is being done to battle it. Although he didn’t speak of the specific cause of his depression, he did say that he just trying “not to think about it”. He battles with Obsessive Compulsive Disorder as well, which can become a problem when it starts to affect your daily life. \r\n\r\nJace Hall, the CEO of Echo Fox has been working with him through this battle. Hall said that he has “explained to him just a couple of ideas” on how to handle things, which seems to be working since his playing has been more consistent over the recent year. Hall said, \"He needs tools, mental tools that he can put in his toolbox that help him process how he feels about things.\"\r\n\r\nWith Echo Fox being owned by none other than \u003ca href='https://en.wikipedia.org/wiki/Rick_Fox'\u003eRick Fox\u003c/a\u003e, former NBA star for the Boston Celtics and Los Angeles Lakers, Zimmerman is probably in a good place for learning how to handle the mental stresses that come with being on top of your game in your industry. However, we aren't sure if that is the cause of the depression that Zimmerman has been experiencing. What is important to recognize is that in accomplishing anything difficult, there will always be some sort of struggle. It isn't easy, but we are all human and we find ways to overcome. \r\n\r\nEsports athletes who are among the best, in any game, are having to learn how to handle fame and the stresses of being in the limelight and staying on top of the competition. It certainly isn’t as easy as it might seem, and there is no question that mental health and fortitude are going to be one of the primary topics of conversation in the coming years. It does seem, however, that with the rising popularity of esports franchises among current or previous traditional sports athletes/team owners that there will be a solid foundation in place as the industry continues to grow into it’s new space.","sourceLink":"http://www.espn.com/esports/story/_/id/21264323/mew2king-continues-battle-smash-self","image":"https://i.imgur.com/XWxxwO5.jpg","imageCaption":"Mew2King in Echo Fox Jersery","imageSource":"echofox.gg","contentType":"standard","categories":["general","Super Smash Bros. Melee","Super Smash Bros. 4"],"published":{"$date":"2017-11-03T16:14:50.000Z"},"__v":0}
{"_id":{"$oid":"59feae0fa96532001201cc4d"},"author":"Nate Chrisman","title":"South Korea Faced Solid Competition 2017's Overwatch World Cup","body":"Team South Korea left trails of fire behind them as they blazed through the top 8 bracket of the Overwatch World Cup. After taking a look back at how they crushed the World Cup in 2016 by not losing a single round in the top 8, it was clear that this year’s teams needed to bring some more to the table. South Korea began their top 8 against Team USA in the quarter-finals, followed by France in the semi-finals, then Canada for the grand-finals. \r\n\r\nClearly the most balanced match in terms of skill for the top 8 we saw today was against Team USA (3-1, technically 4-2 if you include the draw). With the USA starting off strong on Nepal with a win, drawing on Hanamura, and only sparingly trailing behind KR on the other maps by single points (except for the final, which was 2-0), KR found out that they actually had some serious competition this year. Team USA’s ability to adapt to KR’s extremely cohesive and effective gameplay put them on the map, although they ended up with a loss in the end. \r\n\r\nThe semi-finals with France lasted one less match than with USA (3-1). Considering France’s strong victory against China in the quarter-finals, they put up a solid fight, following in USA’s footsteps by closely trailing KR by 1 round on every match they had together. Yet, France did not have enough to pull through with a win.\r\n\r\nKR’s largest win in terms of margin was the grand-finals against Canada (4-1). KR did not give CA any breating room at all out of what was supposed to be 7 matches. KR cleaned house against CA by reaching 4 wins out of the first 5 that were played, having no mercy on the North American team. \r\n\r\n\u003ciframe src=\"https://player.twitch.tv/?video=v187734567\u0026autoplay=false\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\" height=\"378\" width=\"620\"\u003e\u003c/iframe\u003e\r\n\r\nCompared to last year’s gameplay, there is definitely an improvement all around, but KR remains supreme in being able to harness the chaos that can ensue in these matches and use it to their advantage. Out of the top 8, USA appeared to adapt the best to KR’s game, but were still followed closely by France and CA.   \r\n","sourceLink":"","image":"https://i.imgur.com/smkkP7s.jpg","imageCaption":"Team South Korea","imageSource":"playoverwatch.com","contentType":"standard","categories":["general","Overwatch"],"published":{"$date":"2017-11-05T06:22:07.000Z"},"__v":0}
{"_id":{"$oid":"59ff3eb2b416cd00121a4f22"},"author":"Nate Chrisman","title":"K1llsen's First Major Quake Champions Win at Italian Esports Open","body":"Marcel ‘K1llsen’ Paul took home the gold medal in Day 4 of the Quake Champions Italian Esports Open yesterday against Sander ‘Voo’ Kaasjager. With nearly 20 seconds remaining in the 4th round, K1llsen, as Doomslayer, secured himself by being aggressive against Voo and his Nyx for the kill that tied up the round with 2 frags each, taking them into overtime. K1llsen pulled through in overtime by fragging Voo again, then bringing them into the 5th and final round of the tournament where he proved himself worthy of 1st place.\r\n\r\n\u003chr\u003e\r\n\u003ciframe src=\"https://player.twitch.tv/?autoplay=false\u0026video=v187528558\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\" height=\"378\" width=\"620\"\u003e\u003c/iframe\u003e\r\n\u003chr\u003e\r\n\r\nStarting the 5th round with K1llsen’s Nyx and Voo’s Anarchy, both arguably the best at those champions in the game, K1llsen played extremely smart by keeping his distance from Voo and taking advantage of opportunities as they came to him, realizing that patience would prevail in the end. K1llsen took home the trophy with a 3-0 match, making him the man to beat for \u003ca href='https://polar-reef-66613.herokuapp.com/events/59ff401eb416cd00121a4f23'\u003eDreamhack Winter\u003c/a\u003e this December. ","sourceLink":"","image":"https://i.imgur.com/QwZ79BS.jpg","imageCaption":"K1llsen 1st Place Victory","imageSource":"twitter.com/ESLItaly","contentType":"standard","categories":["general","Quake"],"published":{"$date":"2017-11-05T16:39:14.000Z"},"__v":0}
{"_id":{"$oid":"59ff488fb416cd00121a4f24"},"author":"Nate Chrisman","title":"We're Going to See Another Dhalsim in Capcom Cup","body":"The Latin America CPT stop gave us another Dhalsim to watch during the Capcom Cup this year. DidimoKOF fought against Caba's Guile in what was an extremely close battle towards the end with a very interesting matchup. Coming from the losers bracket, Caba had a chance to reset and make DidimoKOF fight hard for his chance to go to Capcom Cup, but DidimoKOF was not going to let that happen. \r\n\r\n\u003chr\u003e\r\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/-1F9wHS66xs?rel=0\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\n\u003chr\u003e\r\n\r\nStarting the set off strong with a 2-0 lead, it seemed that Caba's Guile couldn't adapt to DidimoKOF's Dhalsim play. Caba was forced to react to DidimoKOF's style of a solid mixture of zoning and high pressure techniques. Working hard to adapt, Caba secured one match out of the first 3, and then tied up with set in the 4th match, giving him the chance he needed to reset the bracket for another final set. In the end, Caba's pressure wasn't enough to break DidimoKOF, who secured his spot in the Capcom Cup with a 1st place win and 400 CPT points. ","sourceLink":"https://capcomprotour.com/latin-america-regional-finals-2017-results/","image":"https://i.imgur.com/XRYHa9d.jpg","imageCaption":"DidimoKOF Celebrates Victory","imageSource":"capcomprotour.com","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-05T17:21:19.318Z"},"__v":0}
{"_id":{"$oid":"59ff9094a990b600124e6d68"},"author":"Nate Chrisman","title":"Evo Japan is ARMS’ chance to shine. Does it have what it takes? ","body":"If there is one game on the market right now that is truly different than any other in it’s genre, it would be ARMS. The fighting game for Nintendo Switch seems to have a dedicated community, but does it have the chops to hold its own in the FGC on a competitive level? I think EVO Japan will be the event to reveal that answer. \r\n\r\nSince the release of ARMS in June of this year, it has received critiques from all angles, positive and negative. Everything from the look, mechanics, and depth of the game have been questioned in terms of whether or not it has what it takes to be a serious contender for fighting game esports. \r\n\r\nAs for the look of the game, although it doesn’t have anything to do with the competitive nature, it is unique. In fact, it’s right in line with the type of look you’d expect from a Nintendo exclusive – smooth, cartoonish, and unlike anything else that you might want to compare it to. Each fighter in the game has a clear theme of their own. Their names, looks, and ARMS are all thought out and creates motive to find your favorite. \r\n\r\nOne of the game’s largest critiques stems from the apparent lack of depth or veering too far off the traditional path when it comes to the mechanics of a fight, but that seems to be a little disingenuous. Those who are saying this may just be comparing the gameplay to other fighters that have rapport with the FGC, such as Street Fighter, Marvel vs. Capcom, Tekken, Guilty Gear, and other traditional titles. This can be an unfair comparison if you aren’t careful. ARMS features a 3D plane in which the camera is locked to a behind view of the fighter, which is probably the most notable difference. However, it also rewards the ability to fight your opponent at a distance, which in a fighting game with a boxing focus seems counter-intuitive. This is actually the game’s strong point, in my opinion.\r\n\r\nFighters use their extendable ARMS to fight their opponent. Every fighter has a unique set of ARMS that have different tools which complement the fighter’s theme/background and give the player a specialized tool set to take down their opponent. Since the ARMS extend virtually across each stage, the gameplay rewards those who are able to apply traditional fighting game techniques at a distance, such as zoning, hit confirms, etc. on a 3D plane, instead of trying to scrap with your opponent up close on a 2D plane. \r\n\r\nWith that being said, there has been a popular view (obviously subjective) that, while the gameplay might be engaging as a player, it isn’t engaging to the spectator. So, given the 3D playing field, unique look and mechanics, the game still isn’t as interesting to a lot of people as the other, larger titles. I think that this is where the pain point lies when it comes to whether or not ARMS has what it takes to be a large title in the competitive gaming world. \r\n\r\nFor every professional esports athlete, there are tens of thousands, even hundreds of thousands, of viewers that want to watch the game. This is where the decision is going to be made in terms of its continuance at major tournaments. At the end of the day, it is about the amount of spectators that it can bring to the table. So, it’s definitely different in a lot of areas, but is that what people are asking for? Having non-traditional features, in this case, is a double edged sword. I guess we will have to wait until EVO Japan has finished to see whether or not it will be included in EVO Las Vegas, let alone other FGC majors. \r\n","sourceLink":"","image":"https://i.imgur.com/InrF7nq.jpg","imageCaption":"Spring Man","imageSource":"arms.nintendo.com","contentType":"standard","categories":["general","ARMS"],"published":{"$date":"2017-11-05T22:28:36.427Z"},"__v":0}
{"_id":{"$oid":"5a009419ef85390012ea61de"},"author":"Mike Keppler","title":"Overwatch Inaugural Season Explained","body":"The first Overwatch season is upon us! See the link below to get all the details on when the season will begin and how the contenders will be split up between the two divisions (Pacific and Atlantic). I've listed the main takeaway below.\r\n\r\nPreseason\r\n----\r\nDecember 6–9\r\n\r\nRegular Season\r\n----\r\nStage 1: January 10—February 10\r\nStage 2: February 21—March 24\r\nStage 3: April 4—May 5\r\nStage 4: May 16—June 16\r\n\r\nDivisions\r\n----\r\nPacific Division: Dallas Fuel, Los Angeles Gladiators, Los Angeles Valiant, San Francisco Shock, Seoul Dynasty, Shanghai Dragons\r\nAtlantic Division: Boston Uprising, Florida Mayhem, Houston Outlaws, London Spitfire, New York Excelsior, Philadelphia Fusion\r\n\r\nBonuses\r\n----\r\nStage Title Match bonuses:\r\n\r\nFirst place: USD $100,000\r\nSecond place: USD $25,000 \r\nTotal: USD $500,000 over four stages\r\nRegular Season placement bonuses:\r\n\r\nFirst place: USD $300,000\r\nSecond place: USD $200,000\r\nThird and fourth place: USD $150,000\r\nFifth and sixth place: USD $100,000\r\nSeventh and eighth place: USD $75,000\r\nNinth and tenth place: USD $50,000\r\nEleventh and twelfth place: USD $25,000\r\nTotal: USD $1.3 million\r\nChampionship playoffs placement bonuses:\r\n\r\nWorld Champion: USD $1 million\r\nRunner-up: USD $400,000\r\nThird and fourth place: USD $100,000\r\nFifth and sixth place: USD $50,000\r\nTotal: USD $1.7 million","sourceLink":"https://overwatchleague.com/en-us/news/21108384","image":"https://i.imgur.com/9PMJUzw.jpg","imageCaption":"Overwatch Inaugural Season ","imageSource":"overwatchleague.com","contentType":"standard","categories":["general","Overwatch"],"published":{"$date":"2017-11-06T16:55:53.041Z"},"__v":0}
{"_id":{"$oid":"5a00e46be5e2d90012a6ae3b"},"author":"Nate Chrisman","title":"Dignitas Removes Two Players from CS:GO Roster","body":"After losing to TEAM5, failing to secure their slot to continue in the Europe Minor Championship, Asger ‘AcilioN’ Larsen and Joakim ‘jkaem’ Myrbostad have allegedly removed from Team Dignitas’ roster, according to HTLV.\r\n\r\nLarsen’s career with Dignitas has been short lived, having only been added to the team this past September. The 21 year old joined the team as the ingame leader after playing the past few years for multiple professional teams such as Splyce, SK Gaming, and Tricked Esport. Myrbostad had a slightly longer run with Dignitas, being on the team since March. Myrbostad has held spots on some top teams as well in the recent years, such as FaZe Clan and G2 Esports.  \r\n\r\nAlthough no official statement has been made about the release of these players, Team Dignitas has clearly removed both players from the CS:GO roster \u003ca href='http://team-dignitas.net/teams/counter-strike-global-offensive'\u003eon their website\u003c/a\u003e. Stay posted for a confirmation as soon as it’s announced. ","sourceLink":"https://www.hltv.org/news/21963/dignitas-release-acilion-jkaem","image":"https://i.imgur.com/axQD0ZA.png","imageCaption":"Team Dignitas","imageSource":"team-dignitas.net","contentType":"standard","categories":["general","Counter-Strike: Global Offensive"],"published":{"$date":"2017-11-06T22:38:35.791Z"},"__v":0}
{"_id":{"$oid":"5a01127ffe6af50012bf45f6"},"author":"Nate Chrisman","title":"How to Say 'Boooo' in Australian","body":"\u003ciframe src=\"https://clips.twitch.tv/embed?clip=AverageNiceFinchAMPEnergyCherry\u0026autoplay=false\u0026tt_medium=clips_embed\" width=\"640\" height=\"360\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\"\u003e\u003c/iframe\u003e","sourceLink":"","image":"https://i.imgur.com/CTLuBwl.jpg","imageCaption":"'Booooo' in Australian ","imageSource":"twitch.tv/esl_csgo","contentType":"video","categories":["general","Counter-Strike: Global Offensive"],"published":{"$date":"2017-11-07T01:55:11.000Z"},"__v":0}
{"_id":{"$oid":"5a01dbb78d412000121609c7"},"author":"Nate Chrisman","title":"Talking Stick Resort in Phoenix Doubles Down on Smash Esports ","body":"Ramon Martinez, director of public relations for Talking Stick Resort in Phoenix said, right before they hosted their first FGC tournament in October of this year, \u003ca href='https://www.prnewswire.com/news-releases/first-esports-tournament-at-talking-stick-resort-this-saturday-300538130.html'\u003e\"eSports is the future of sports and entertainment and we are Arizona's home for it.\"\u003c/a\u003e Well, that event went off without a hitch, so they're hosting another one in what they're saying is a series of local events. \r\n\r\nSo, November 18th brings a $5,000 prize pool for Smash 4 and Smash Melee competitors. Each title will have singles and doubles, and will cost you about $25 to enter the competition depending on what you want to compete in. \r\n\r\n\u003chr\u003e\r\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/OeO8Oo-BVWM?rel=0\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\n\u003chr\u003e\r\n\r\nThey've recruited Michael Udall, an Arizona local who won his tuition at Arizona State University by competing in esports. Udall's specialty is in Heroes of the Storm, but with being in the competitive gaming world for the past few years, he's probably a good person to have on their team. \r\n\r\nIs this the next big step for esports in Arizona? It seems as if the event experts at Talking Stick are all in. It wouldn't be surprising to see other titles in the near future.","sourceLink":"https://www.talkingstickresort.com/phoenix-scottsdale-concerts-entertainment/entertainment-listing/the-showroom/esports-arizona-desert-showdown/","image":"https://i.imgur.com/qYrlaC8.jpg","imageCaption":"Talking Stick Resort","imageSource":"cvent.com","contentType":"standard","categories":["general","Super Smash Bros. Melee","Super Smash Bros. 4"],"published":{"$date":"2017-11-07T16:13:43.000Z"},"__v":0}
{"_id":{"$oid":"5a0260f7ffd4ff00128447ab"},"author":"Mike Keppler","title":"New Hero and Map for Overwatch!","body":"The latest addition to the Overwatch roster is the much anticipated support healer going by the name Moira. Like Zenyatta (except polar opposite on the morality scale), Moira has the ability to provide healing to her teammates while also contributing damage to the enemy team. She can also provide healing to herself by sapping the life force from enemies using her “Biotic Grasp” command. Another unique ability in Moira’s arsenal is “Fade” which allows her to quickly teleport a short distance to easily stay close to her team or escape danger. Not only that, but she looks great especially with her community requested “Naruto-run” which got many Overwatch fans giddy with excitement. Finally, her ultimate ability “Coalescence” allows Moira to blast out a stream of healing power and damage giving her the opportunity to heal allies and damage enemies at the same time.\r\n\r\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/8tLopqeL9s8\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\n\r\nNot only are we receiving a new hero, but a new map as well! I got a rush of feelings when the new map, Blizzard World, was announced. When Jeff Kaplan (creative director of Overwatch) was on the Mythic stage at Blizzcon during the opening ceremony, he asked the crowd how they would feel about a Blizzard amusement park.  My first thought was them announcing that they are going to build an actual amusement park (like what Nintendo is doing). After I pushed that idea out of my head, I realized that this amusement park is going to be the next map!\r\n\r\nServing as a hybrid map, the attacking team will have to capture a point which will unlock the payload. From this point, the attackers will have to escort the payload for the remainder of the match. What makes this map stand out is that the two teams will be fighting in Blizzard World which is an amusement park with all of Blizzard’s famous IP.  Players will fight through the Warcraft, Starcraft and Diablo universes as they push the payload to the goal line. This works since Blizzard actually exists within the world of Overwatch (in a timeline where Blizzard never developed Overwatch or else the hole would get really, really deep).\r\n\r\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Ii3Hce3_fOw\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\n\r\nMoira went live on the PTR today and Blizzard World will most likely follow in the next few weeks.","sourceLink":"https://playoverwatch.com/en-us/heroes/moira/","image":"https://i.imgur.com/BOzm3fo.png","imageCaption":"Moira","imageSource":"Blizzard","contentType":"standard","categories":["general","Overwatch"],"published":{"$date":"2017-11-07T18:13:43.000Z"},"__v":0}
{"_id":{"$oid":"5a033927b3e7ca0012dbed12"},"author":"Nate Chrisman","title":"MK Leo on Being #1: \"I’m going to be the best in the world. I can and I want to\"","body":"Sparkd Productions and MK Leo teamed up to give us a deeper look into the top Smash 4 player’s life, and it’s full of both hardships and successes. At only 7 years old, MK Leo was introduced to Smash as a game to play for fun, but little did he know that he would become the current second best player in the world with ambitions (justified) to become the absolute best. \r\n\r\nHe comes from a loving family in Mexico where he had plans to continue with his education and study, but that quickly changed as his ability to compete and win in Smash started to take him down an entirely different route. He was always on the road, competing and fighting for his career as an esports athlete. His immediate family, who was initially a bit skeptical about his tournament-going lifestyle, eventually came to realize that MK Leo could make something of himself in a community that arguably has one of the tallest hills to climb. \r\n\r\nIn fact, the “MK” in his name comes from the part of his family who was one of the most supportive – his brother and the store he owns called “Monster Kingdom”. His brother enjoyed playing Smash as well and also competes with the ambition to go far, but felt that he could provide MK Leo with even more support by making Monster Kingdom his official first sponsor. \r\n\r\nMK Leo has been competing in a lot of 2GG tournaments, which he holds with high praise, but his favorite was the Zero Saga. His third appearance in the United States was last year, where he started off with a loss and then ended up taking down the tournament in the end with first place. “Who knows where I got the powers,” he said, but clearly they come naturally. \r\n\r\n\u003chr\u003e\r\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/FhX7mvE165g?rel=0\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\n\u003chr\u003e\r\n\r\nAs he has climbed the ranks of the Smash community, he makes mentioned that he continues to feel more stress. Stating that “people expect more of you” and “it’s always difficult.” Rightfully so, as fighting for that number 1 spot is going to require that you are constantly one-upping yourself and those around you. \r\n\r\nMK Leo and his brother say that they have one strategy: “Do things right and win.” Seems simple enough. He concluded by saying “I’m going to be the best in the world. I can and I want to.” \r\n\r\n","sourceLink":"https://twitter.com/sparkdstudiosla","image":"https://i.imgur.com/YlAmJXw.jpg","imageCaption":"MK Leo travelling, as always ","imageSource":"twitter.com/mkleosb","contentType":"standard","categories":["general","Super Smash Bros. 4"],"published":{"$date":"2017-11-08T17:04:39.000Z"},"__v":0}
{"_id":{"$oid":"5a047962885e100012ec0e31"},"author":"Nate Chrisman","title":"Team Liquid's INTERNETHULK Passes Away","body":"Some time yesterday, on November 8th, the professional Overwatch coach and player for Team Liquid had passed away. At the current time, the cause of death is unknown to us, but his name certainly is not. \r\n\r\nDennis Hawelka, INTERNETHULK, has been involved in competitive gaming for quite some time, playing for Team EnvyUs, then eventually moving on to both playing and coaching for Team Liquid. Overwatch League's Nate Nanzer expressed his gratitude for HULK, saying \"We will make you proud brother Hulk. Words can’t express my thanks for your effort and energy as we started to build OW esports.\"\r\n\r\nThere is a lot of buzz talk about creating an award for OWL in his name, cementing his place in the esports community that we all know and love. Here's a short video of INTERNETHULK as Team Liquid welcomed him to their Overwatch division. \r\n\r\n\u003chr\u003e\r\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/sEEtWGfNHBc?rel=0\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\n\u003chr\u003e","sourceLink":"https://twitter.com/TeamLiquid","image":"https://i.imgur.com/0XMXOGM.jpg","imageCaption":"INTERNETHULK, all smiles","imageSource":"Blizzard Entertainment","contentType":"standard","categories":["general","Overwatch"],"published":{"$date":"2017-11-09T15:50:58.000Z"},"__v":0}
{"_id":{"$oid":"5a051e112ced9b00127120a2"},"author":"Nate Chrisman","title":"Circa eSports Brings Wolfkrone on Board","body":"Street Fighter's renowned Laura player, Joshua Philpot, known as Wolfkrone was just officially signed to Circa eSports. Circa has been around since 2015, but has a lot of key esports athletes across an array of titles. \r\n\r\nAlthough Circa has only been around only a couple of years, Wolfkrone has been a part of the FGC for many. Known for both his skill and (particularly recent) rivalries with other players in the FGC, he's certainly made a big name for himself recently. In fact, he just took first place at Youmacon 2017 this past week. \r\n\r\n\u003chr\u003e\r\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/6h3sHx5nPyc?rel=0\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\n\u003chr\u003e\r\n\r\nSo, if you've paid any attention to Street Fighter in the recent years, you've definitely heard or seen his name, but it wasn't until recently that he had a solid sponsor. In a welcoming interview with Circa as he was brought onto the team, he was asked about the overall sentiment in the competitive Street Fighter scene, but particularly about how some of the \"elitist\" problems (as Circa puts it) have grown over the recent years. Wolfkrone said, \"I take tournaments very serious because winning means everything to me. Being in the scene many years I’ve seen players lose sight of their true purpose.\"\r\n\r\nWe wish Wolfkrone luck on his new journey with Circa eSports! ","sourceLink":"http://circaesports.com/articles/features/business/54/circa-esports-welcomes-wolfkrone","image":"https://i.imgur.com/svuWsTE.jpg","imageCaption":"Wolfkrone in Circa eSports swag","imageSource":"circaesports.com","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-10T03:33:37.000Z"},"__v":0}
{"_id":{"$oid":"5a05c896efb2780012d3fb12"},"author":"Nate Chrisman","title":"fnatic Drops Out of Home Competition Dreamhack Winter","body":"Dreamhack Winter, which is held in Jönköping, Sweden just had a recent drop out by Team fnatic citing both personal and scheduling related issues, according to HLTV. Being Sweden's hallmark CS:GO team, some people are disappointed that they won't be able to root for the home team next month. \r\n\r\nReplacing fnatic is Team BIG from Germany. You can watch Germany playing in the ESL Pro League EU Season 6 today and tomorrow to get a look at what you can expect from them at Dreamhack Winter. \r\n\r\nThe eight teams playing at Dreamhack Winter this year are as follows: \r\n\r\n\r\n\u003ca href='https://teamenvyus.com/pages/counter-strike' target='_blank'\u003eEnVyUs\u003c/a\u003e\r\n\u003ca href='http://heroic.gg/' target='_blank'\u003eHeroic\u003c/a\u003e\r\n\u003ca href='http://navi-gaming.com/en' target='_blank'\u003eNatus Vincere\u003c/a\u003e\r\n\u003ca href='https://gambit.gg/ target='_blank'\u003eGambit\u003c/a\u003e\r\n\u003ca href='http://www.mousesports.com/' target='_blank'\u003emouseports\u003c/a\u003e\r\n\u003ca href='bigclan.gg' target='_blank'\u003eBIG\u003c/a\u003e\r\nEU Qualifier\r\nNA Qualifier\r\n\r\n","sourceLink":"https://www.hltv.org/news/21988/big-replace-fnatic-at-dreamhack-winter","image":"https://i.imgur.com/foXnlld.png","imageCaption":"Team BIG","imageSource":"bigclan.gg","contentType":"standard","categories":["general","Counter-Strike: Global Offensive"],"published":{"$date":"2017-11-10T15:41:10.000Z"},"__v":0}
{"_id":{"$oid":"5a05eb50efb2780012d3fb13"},"author":"Mike Keppler","title":"New Arms Content Teased!","body":"The official ARMS twitter account has been teasing new content for the game, including a new fighter and stage. Going off the image that was tweeted, it appears the new stage (and most likely fighter) will be jungle/Mayan themed, which is absolutely awesome! Here’s a rather rough translation (thanks Google!) of the tweet:\r\n\r\n“A wonderful pillar that feels the weight of this history!\r\nPetapeta touches and also makes me wonderful about history ... Ugh ...\r\n \r\nBy the way, it seems that the face engraved on this pillar is God who is believed in this region.\r\n\r\nOverflowing godness, intimidating sense of pressure! ... And affinity! Does not it resemble myself for a moment? Hora, divinity and so on ...”\r\n \r\nA God in the region? Is Biff referring to an actual mystic God who is believed to watch over this forest/jungle? Or perhaps the new fighter is looked up to as a God by its local inhabitants?  Only time will tell as we inch closer to the official reveal of this new content!\r\n\r\nP.S.  We got a full body shot of Biff and he’s not wearing pants! Would make sense since he only has ARMS on his mind…I’ll see myself out.","sourceLink":"https://twitter.com/arms_cobutter/status/928820010834726912","image":"https://i.imgur.com/ni7O7g3.jpg","imageCaption":"New ARMS Stage","imageSource":"ARMS Twitter","contentType":"standard","categories":["general","ARMS"],"published":{"$date":"2017-11-10T18:09:20.591Z"},"__v":0}
{"_id":{"$oid":"5a060af9efb2780012d3fb14"},"author":"Nate Chrisman","title":"CPT Latin America Top Hype Moments","body":"\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/miWjbET3aFc?rel=0\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e","sourceLink":"https://www.youtube.com/watch?v=miWjbET3aFc","image":"https://i.imgur.com/H2YWnDr.jpg","imageCaption":"Video Screenshot","imageSource":"Hype Video","contentType":"video","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-10T20:24:25.248Z"},"__v":0}
{"_id":{"$oid":"5a0711b12aa19500129c042d"},"author":"Nate Chrisman","title":"Want to talk to Team South Korea from OWWC? Participate in their AMA!","body":"As if watching them during the Overwatch World Cup wasn't entertaining enough, you can now get real deep by asking 3 members from Team South Korea anything you want! Starting on November 12th, \u003ca href='https://www.invenglobal.com'\u003eInven Global\u003c/a\u003e will be holding the AMA's on their own site. They're even accepting questions right now bwfore it starts. Here's how it's going down. \r\n\r\nAt 10:00PM PT on November 12th, Jong-yeol “Saebyeolbe” Park will be the first to be accepting questions. The next day Dong-gyu \"Mano\" Kim will start an AMA at 8:00PM PT on November 13th. Last, but not least Yeon-oh \"Fl0w3r\" Hwang will do his AMA at 10:00PM on November 13th. \r\n\r\nIf you participate in any one of the AMA's, you'll have a chance to win some goods. Inven Global is going to be giving $20 Blizzard Balance to 5 randomly selected participants (seems like this is for each AMA). Some important info from their site just to ensure everyone knows the specifics: \r\n\r\n※ Important notice regarding event prizes\r\n\r\n- Blizzard Balance cards are for the North American server and cannot be redeemed on other servers.\r\n- Blizzard Balance will be provided in a code format via the e-mail address you registered with at Inven Global website.\r\n\r\nHere are the links to each AMA: Ask away and have fun! \r\n\r\n\u003ca href='https://www.invenglobal.com/articles/3492/ama-with-fl0w3r-ask-us-anything-and-win-free-blizzard-balance'\u003eFl0w3r AMA\u003c/a\u003e\r\n\r\n\u003ca href='https://www.invenglobal.com/articles/3491/ama-with-saebyeobe-ask-us-anything-and-win-free-blizzard-balance'\u003eSaebyeobe AMA\u003c/a\u003e\r\n\r\n\u003ca href='https://www.invenglobal.com/articles/3492/%20https://www.invenglobal.com/articles/3490/ama-with-mano-ask-us-anything-and-win-free-blizzard-balance'\u003eMano AMA\u003c/a\u003e***\r\n\r\n***Mano's AMA Link is currently broken, but once they fix it, we'll update this post if needed. ","sourceLink":"https://www.invenglobal.com/articles/3492/ama-with-fl0w3r-ask-us-anything-and-win-free-blizzard-balance","image":"https://i.imgur.com/ObQkDMJ.jpg","imageCaption":"Team Korea","imageSource":"Inven Global","contentType":"standard","categories":["general","Overwatch"],"published":{"$date":"2017-11-11T15:05:21.000Z"},"__v":0}
{"_id":{"$oid":"5a07197d2aa19500129c042e"},"author":"Nate Chrisman","title":"Insane 0-death from Larry Lurr","body":"\u003ciframe src=\"https://clips.twitch.tv/embed?clip=ProtectiveCrowdedVanillaPlanking\u0026autoplay=false\u0026tt_medium=clips_embed\" frameborder=\"0\" width=\"640\" height=\"360\" scrolling=\"no\" allowfullscreen=\"true\"\u003e\u003c/iframe\u003e","sourceLink":"","image":"https://i.imgur.com/uRVnbRF.jpg","imageCaption":"video screenshot","imageSource":"twitch.tv","contentType":"video","categories":["general","Super Smash Bros. 4"],"published":{"$date":"2017-11-11T15:38:37.000Z"},"__v":0}
{"_id":{"$oid":"5a0c67f62903ef00148afbd7"},"author":"Nate Chrisman","title":"Somebody gave four OWL teams some new sponsors, and they're pretty awesome","body":"A quick peek on Instagram, searching through some Overwatch memes (as you normally would on a daily basis), and you'll surely find these 4 \"(un)official\" team sponsors. Somebody out there matched the colors of these teams to some major corporations that we're all familiar with. Although they're funny, a couple of them might actually work! Here they are, in all of their glory: \r\n\r\n\u003ch3\u003eSeoul Dynasty\u003c/h3\u003e\r\n\u003cimg src='https://i.imgur.com/66PkSW1.jpg' alt='Seoul Dynasty Overwatch League Team Colors'\u003e\r\n\r\n\u003ch3\u003eHouston Outlaws\u003c/h3\u003e\r\n\u003cimg src='https://i.imgur.com/8dyWZfU.jpg' alt='Houston Outlaws Overwatch League Team Colors'\u003e\r\n\r\n\u003ch3\u003eSan Francisco Shock\u003c/h3\u003e\r\n\u003cimg src='https://i.imgur.com/iSgOeub.jpg' alt='San Francisco Shock Overwatch League Team Colors'\u003e\r\n\r\n\u003ch3\u003eLos Angeles Valiant\u003c/h3\u003e\r\n\u003cimg src='https://i.imgur.com/IgAskn3.jpg' alt='Los Angeles Valiant Overwatch League Team Colors'\u003e\r\n\r\nWhat do you think of these? Tag us on social! \r\n\r\nWe found these on \u003ca href='http://www.instagram.com/over.watch.memes' target='_blank'\u003eover.watch.memes' Instagram Profile\u003c/a\u003e","sourceLink":"","image":"https://i.imgur.com/Fx3KMma.png","imageCaption":"OWL Team Logos","imageSource":"Blizzard Entertainment","contentType":"standard","categories":["general","Overwatch League","Overwatch","Houston Outlaws","Los Angeles Valiant","San Francisco Shock","Seoul Dynasty"],"published":{"$date":"2017-11-15T16:14:46.000Z"},"__v":0}
{"_id":{"$oid":"5a0c793b2903ef00148afbde"},"author":"Nate Chrisman","title":"MVCi and ARMS have been nominated for best fighting game","body":"Two of this years' newly released fighting games have been nominated for \"Best Fighting Game\" on \u003ca href='http://thegameawards.com/awards/#best-fighting-game' target='_blank'\u003eTheGameAwards.com\u003c/a\u003e. Both ARMS and MVCi are going up against Tekken 7, Nidhogg 2, and Injustice 2. \r\n\r\nMVCi is going up against some heavy hitters, but it certainly has the history to help with that. The Marvel vs. Capcom franchise started with the release of X-Men vs. Street Fighter, an Arcade style game, in 1996. MVCi is the 8th title in the franchise, which allows it to hit the ground running, so to speak, in competitions like these. \r\n\r\nARMS, on the other hand, is completely new to the FGC, so it has more work to do. However, its so different that it might make it pretty far on that alone - the fact that it really isn't like any other fighting game out there. Plus, its a Nintendo exclusive, so it has a smaller (in terms of fighting games), but dedicated community. \r\n\r\nHead on over to the voting page and cast your vote. The results are going to be revealed live on December 7th! Plus, there are other categories as well. ","sourceLink":"http://thegameawards.com/awards/#best-fighting-game","image":"https://i.imgur.com/iuwrYDO.png","imageCaption":"MVCi vs. ARMS","imageSource":"Nintendo (ARMS) | Capcom (MVCi)","contentType":"standard","categories":["general","ARMS","Marvel vs. Capcom: Infinite"],"published":{"$date":"2017-11-15T17:28:27.000Z"},"__v":0}
{"_id":{"$oid":"5a0c987318741d00141b15f2"},"author":"Nate Chrisman","title":"'The Dennis Hawelka Award' announced by Overwatch League ","body":"If you've been following the Overwatch community recently, you certainly know of Dennis 'INTERNETHULK' Hawelka's passing. Dennis was such a positive force in not only the Overwatch community, but any other community he was involved in. His place within the community is being solidified by Overwatch League, which has announced 'The Dennis Hawelka Award'. The article on Overwatch League's website states:\r\n\r\n\"This award will be presented at the end of each Overwatch League season to the player that we deem to have had the most positive impact on the community.\r\n\r\nFrom all of us here at the Overwatch League and Blizzard Entertainment, we send our deepest condolences to Dennis’ loved ones. His intelligence, generosity and friendship will never be forgotten.\"\r\n\r\nIt's amazing to see the amount of appreciation that this community has for it's own people. This award is most certainly going to be a constant reminder of why we're all here, why we do what we do. \r\n\r\n ","sourceLink":"https://overwatchleague.com/en-us/news/21194321","image":"https://i.imgur.com/zJNAL2I.jpg","imageCaption":"Dennis 'INTERNETHULK' Hawelka","imageSource":"twitter.com","contentType":"standard","categories":["general","Overwatch League","Overwatch"],"published":{"$date":"2017-11-15T19:41:39.462Z"},"__v":0}
{"_id":{"$oid":"5a0d01c518741d00141b15f3"},"author":"Nate Chrisman","title":"'Misango' is ARMS' new fighter","body":"As part of the ARMS 4.0 update, Nintendo is releasing their new fighter 'Misango' for ARMS! The update is free, which includes Misango, a new stage, and three new arms - a pretty solid update. \r\n\r\nAs for Misango himself, he's a spiritual guy who has an entity that follows him wherever he goes - to fight, to train, to sleep, to ______. This is something new we've seen in ARMS, and it's almost Pokken-esque in the sense that this entity is going to act as support in cases where it's charged up. It'll be able to grant Misango protection from flinching and increased speed in some cases. \r\n\r\n\u003cimg src='https://i.imgur.com/0UJDYmB.jpg' alt='ARMS Misango Entity Protection'\u003e\r\n\r\nThe three ARMS that he's bringing to the game look pretty versatile. All three ARMS have the ability to poison their opponent. The Scorpio are exactly what they sound like - scorpions. They appear to be pretty quick and can be used for some interesting setups as they're hard to read. \r\n\r\n\u003cimg src='https://i.imgur.com/1x006eY.jpg' alt='ARMS Misango Scorpio arm'\u003e\r\n\r\nThe second arm is the Glusher - heavy, a bit slow, but powerful. And as I said before, it also has the ability to poison on contact. \r\n\r\n\u003cimg src='https://i.imgur.com/1wafVVY.jpg' alt='Misango Glusher arm'\u003e\r\n\r\nThat leaves us with Skully. From the video, this arm is stupid fast. Easy to pop in and out to utilize the poking game. \r\n\r\n\u003cimg src='https://i.imgur.com/EeTAQeY.jpg' alt='ARMS Misango Skully arm'\u003e\r\n\r\nEnjoy Misango and the three new ARMS in the lush, tropical vibes of the Temple Grounds - the new map released with this update. All-in-all, this 4.0 update seems pretty freakin' cool. Get do updating! \r\n\r\n\u003ciframe src=\"https://www.youtube.com/embed/JzH6wtGeaBM\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e","sourceLink":"","image":"https://i.imgur.com/Zl1aogg.jpg","imageCaption":"Misango's Special","imageSource":"Nintendo","contentType":"standard","categories":["general","ARMS"],"published":{"$date":"2017-11-16T03:11:01.562Z"},"__v":0}
{"_id":{"$oid":"5a0dc6fb18741d00141b15f4"},"author":"Mike Keppler","title":"‘Party Crash’ Event Coming to ARMS","body":"Along with the new ARMS update which just recently dropped, players will get to experience the first in-game event.  Titled ‘Party Crash’, the event will take place 11/22 – 11/24 (similar to Splatoon’s Splatfest) and will allow players to choose sides in a Battle for Stardom.  From what I’ve gathered, if players choose either Spring Man or Ribbon Girl (along with specific ARMS) they will earn bonus rewards during the event.  At the end of the event, whichever character has the most cumulative wins will be declared the winner.  \r\n\r\nThis seems like a fun way to bring the community together and settle once and for all who the better fighter is! Who are you going to side with? Personally, I think Ribbon Girl will be the star but if my Splatoon 2 Splatfest track record is anything the go by, I’m probably wrong. Hopefully this is just a taste of things to come regarding events within the ARMS universe!  See you out there!\r\n\r\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/faGcg4xswtE\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e","sourceLink":"","image":"https://i.imgur.com/dGBjtSK.jpg","imageCaption":"ARMS Party Crash","imageSource":"Nintendo","contentType":"standard","categories":["general","ARMS"],"published":{"$date":"2017-11-16T17:12:27.727Z"},"__v":0}
{"_id":{"$oid":"5a0dcd7418741d00141b15f5"},"author":"Mike Keppler","title":"Possible New Overwatch Hero Teased?","body":"Today on the Overwatch subreddit, user EnjiYamakuza brought to light that Blizzard may have teased a Talon tank (it could easily be any other role) in the Moira origin story artwork.  As you can see on the back wall, there’s a man in an LED like suit with a bunch of other diagnostic related graphs around it.  If this is true, maybe it’s possible that the Talon organization has created this entity and he (or she) is currently going through the testing phases before being launched out into the world?\r\n\r\nTo give more credibility to this tease, the original artist of this design had a slightly different version of the image in question.  Look and see for yourself.  What do you think?\r\n\r\n\u003cimg src='https://i.imgur.com/6OIVC2s.jpg' alt='Possible New Hero'\u003e\r\n\r\nThis just adds to the growing list of heroes (or villains) that could make their way into the Overwatch arena.\r\n","sourceLink":"https://www.reddit.com/r/Overwatch/comments/7dcdsl/blizzard_may_have_subtly_teased_a_talon_tank/","image":"https://i.imgur.com/b33ob7a.jpg","imageCaption":"Possible New Overwatch Hero","imageSource":"Blizzard","contentType":"standard","categories":["general","Overwatch"],"published":{"$date":"2017-11-16T17:40:04.000Z"},"__v":0}
{"_id":{"$oid":"5a0e0d3a555f53001461d22a"},"author":"Nate Chrisman","title":"Two events left to qualify for Capcom Cup","body":"As we close in on Capcom Cup in three weeks, there are two more events for those who wish to give it one last shot at making into the end-all-be-all of Street Fighter in 2017. One of those is, as always, the Last Chance Qualifier in Anaheim, CA. \r\n\r\nThe LCQ will be held on Friday December 8th at the Anaheim Convention center. It's only $20 to enter and limited to 256 players. So if you haven't registered yet and are thinking of making one last push, go to \u003ca href='https://smash.gg/tournament/capcom-cup-sfv-last-chance-qualifier' target='_blank'\u003eSmash.gg\u003c/a\u003e to get your name down. If anything, you get a free t-shirt for registering. It's hardly a reward for drowning in those pools, but still something nonetheless. If you wait to register until you're on site (if there are any slots left), then you'll end up forking out $40. \r\n\r\n\u003cimg src='https://i.imgur.com/ROTkhPe.jpg' alt='Red Bull Battle Grounds'\u003e\r\n\r\nAs for the other event coming up before Capcom Cup, thats the Red Bull Battle Grounds in Boston, MA on November 18th and 19th. It appears that the registration is still open for this one, so if you've got some CPT points and are looking to get bumped up to the top 32 to qualify for Capcom Cup, then get in on this one, too. You can register for $10 on \u003ca href='https://smash.gg/tournament/red-bull-battle-grounds-2017-1/register' target='_blank'\u003eSmash.gg\u003c/a\u003e as well. It's a 512 player bracket, so at the current time (2PM PST, Nov. 18th), there are 411 competitors. \r\n\r\nSo get on it, scrubs! EST will be attending Capcom Cup, so we'll see you there! ","sourceLink":"","image":"https://i.imgur.com/pIUe9uA.jpg","imageCaption":"Capcom Cup LCQ","imageSource":"CapcomProTour.com","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-16T22:12:10.000Z"},"__v":0}
{"_id":{"$oid":"5a0f68392d218d00147124b9"},"author":"Mike Keppler","title":"Pokkén Tournament Update Now Live","body":"The first Pokkén Tournament DX update for the Nintendo Switch is here!  Here’s a quick overview of what was added.\r\n\r\n1)  Players will now be able to engage in Team Battles while playing online.  This means each player will have the opportunity to choose three Pokémon to duke it out in the battle arena.  While this may seem like something out of a tag team game like Marvel vs Capcom, it does function a bit differently.  During the battle, there's no active swapping out your team and assists will still be reserved for assist Pokémon.  After a Pokémon is KO’d, that player will then select another Pokémon from their team to resume the battle.  Another interesting piece is Pokémon will not recovering health in between rounds.  Once a player’s team has been KO’d, the match will be over.  Sounds pretty great!\r\n\r\n2)  There will be official groups players can join while playing online.  Doing well in these will reward players with special titles.\r\n\r\n3)  A recording tool has been added to the Free Training mode to give players better opportunities to train against certain attacks and play styles.\r\n\r\nThat’s all there is for the first update.  Fingers crossed for some new Pokémon to enter the battle arena in the near future!\r\n","sourceLink":"https://www.nintendo.com/whatsnew/detail/the-pokken-tournament-dx-update-has-arrived","image":"https://i.imgur.com/9CilON2.jpg","imageCaption":"Pokkén Tournament DX","imageSource":"Nintendo","contentType":"standard","categories":["general","Pokken Tournament DX"],"published":{"$date":"2017-11-17T22:52:41.949Z"},"__v":0}
{"_id":{"$oid":"5a10ead1946a040014697fa3"},"author":"Nate Chrisman","title":"Is Dallas Fuel's decision not to further punish xQc setting a low bar?","body":"Just the other day, one of Dallas Fuel's team members, xQc, was banned by Blizzard for a period of 72 hours for using the in-game reporting system inappropriately. As of this afternoon, Dallas Fuel posted on their social media that after speaking with the OWL commissioner Nate Nanzer and Felix, a decision has been made to not pursue any further punishment. \r\n\r\n\u003chr\u003e\r\n\u003cimg src='https://i.imgur.com/VOSakEu.png' alt='Dallas Fuel xQc Ban'\u003e\r\n\u003chr\u003e\r\n\r\nWith this event being the first incident since the assembly of the Overwatch League having to do with players being reprimanded for their actions, are we getting an idea of how issues like this will be handled in future cases? Is this a case where something else should have been done? Does this set the expectations for professionalism too low for players in the OWL? \r\n\r\n\u003chr\u003e\r\n\u003ciframe src=\"https://www.youtube.com/embed/6YhfwfMgYgw?start=407\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\n\u003chr\u003e\r\n\r\nOne thing to take into account is that these players are no longer only streamers or players for a one off team. The OWL is an entirely new entity and as such, it needs to hold a level of professionalism that is a little bit different than others. That means that these players are representing something that is larger and more in the public eye than they ever have, so it's going to be an adjustment for them. That's potentially where Fuel and Nanzer were coming from when this decision was made. \r\n\r\n\u003chr\u003e\r\n\u003ciframe src=\"https://clips.twitch.tv/embed?clip=AmericanUninterestedGoshawkEagleEye\u0026autoplay=false\u0026tt_medium=clips_embed\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\"\u003e\u003c/iframe\u003e\r\n\u003chr\u003e\r\n\r\nEven off camera, using the reporting system in the way that he did, one would find that at least the ban was justified. However, now being a part of Dallas Fuel, a lot more is at stake than just his own reputation. Hopefully this will not continue to be something that is given a free pass in the future. xQc has issued an apology on his social media, saying that he \"wasn't thinking clearly\".  \r\n\r\n\u003chr\u003e\r\n\u003cimg src='https://i.imgur.com/mA89EF9.png' alt='xQc Ban Apology'\u003e\r\n\u003chr\u003e","sourceLink":"https://twitter.com/DallasFuel/status/931970007705292801","image":"https://i.imgur.com/cZjxMPh.jpg","imageCaption":"Dallas Fuel","imageSource":"Blizzard Entertainment","contentType":"standard","categories":["general","Overwatch League","Overwatch","Dallas Fuel"],"published":{"$date":"2017-11-19T02:22:09.000Z"},"__v":0}
{"_id":{"$oid":"5a120eb4946a040014697fa4"},"author":"Mike Keppler","title":"Punk wins North American Regional Finals 2017","body":"This afternoon, Punk has secured his title as the Street Fighter V North American Champion with a 3-0 win over Idom!  This win would usually secure a spot in the Capcom Cup bracket but Punk already held the number one spot there with a hefty 2680 points.  His win set in stone the complete bracket of players that will be competing for the notorious Capcom Cup this December.  With the defeat of Idom, the final player cemented in the bracket is Sako (I bet he was sweating bullets before the Grand Finals started).\r\n\r\nShout out to Punk for this victory but I would like to give a bigger shout out to CoolKid93 with his extremely impressive Abigail plays that landed him a spot in this tournament.  Definitely pay attention to this guy during season three, because he puts in some serious work into his technique and it shows.\r\n\r\nHere's a clip of the Grand Finals between Punk and Idom in case anybody missed it.\r\n\r\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/-Ve3Czx6t_4\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\n\r\nCapcom Cup here we come!  Get Hype!","sourceLink":"","image":"https://i.imgur.com/ROTkhPe.jpg","imageCaption":"Red Bull Battlegrounds","imageSource":"Red Bull","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-19T23:07:32.012Z"},"__v":0}
{"_id":{"$oid":"5a12f99159df8d00148be959"},"author":"Nate Chrisman","title":"A seasoned esports vet, a StarCraft pro, and a data analyst walk into a bar","body":"Shanghai Dragons have a three person coaching staff that's a rock solid mixture of hardcore analytics and many years of professional gaming history. They've just posted some bits on their three coaches via \u003ca href='https://twitter.com/ShanghaiDragons' target='_blank'\u003eTwitter\u003c/a\u003e that give us an idea of who is going to be guiding the Dragons through the first season. \r\n\r\n\u003ch3 style='text-align: center'\u003eChen Congshan - 'U4'\u003c/h3\u003e\r\n\r\n\u003cimg src='https://i.imgur.com/WrDJgfU.png' alt='Shanghai Dragons Lead Coach U4'\u003e\r\n\r\nU4 is the lead coach for this bad boy. He's been in the esports world for 13, going on 14, years. He has a history in the FPS realm, known for \"his game sensitivity, tactical expertise, and strict coaching style.\" In fact, he was behind the teams in the Overwatch Premier Season in 2017 who won 2nd place (Spring), 4th place (Summer), and quarter finalists (Grand Finals - Winter/Fall). He's ready to put this team into beast mode. \r\n\r\n\u003ch3 style='text-align: center'\u003eSon Jun Young - 'Kong'\u003c/h3\u003e\r\n\r\n\u003cimg src='https://i.imgur.com/tJpOHoH.png?1' alt='Shanghai Dragons Coach Kong'\u003e\r\n\r\nKong has been in around the Blizzard block a few times, competing in StarCraft II and Heroes of the Storm. So he's no stranger to being competitive and doing what it takes to get things done. He was the coach for the Overwatch teams Mighty Storm and Mighty AOD. He's got two 3rd place and one 4th place placement(s) under his belt for the Overwatch APEX (2016), APEX (2017), and Nexus Year-End FInal (2016), respectively. \r\n\r\n\u003ch3 style='text-align: center'\u003eJia Jia - 'Nai8'\u003c/h3\u003e\r\n\r\n\u003cimg src='https://i.imgur.com/hTHwLZ4.png' alt='Shanghai Dragons Data Analyst Nai8'\u003e\r\n\r\nNai8 is the guy you call when you want some quantitative insights. He's the Data Analyst for the Dragons, but he's also a seasoned Overwatch pro. Coaching teams to a first place victory in Blizzard Gold Competition (Shanghai), top 4 placement in APAC, top 8 for OWWC, and 2nd place in OTS' second season, clearly he knows how to find the weak spots in his opponents and strengths within his own team. \r\n\r\nIt looks like Shanghai Dragons have a pretty well-rounded coaching staff. Let's see how they're able to apply the past experience and gumption to get to the top of the ranks this OWL! \r\n\r\n","sourceLink":"https://twitter.com/ShanghaiDragons","image":"https://i.imgur.com/UxXCvBt.png","imageCaption":"Shanghai Dragons Coaching Announcement","imageSource":"Blizzard Entertainment","contentType":"standard","categories":["general","Overwatch League","Overwatch","Shanghai Dragons"],"published":{"$date":"2017-11-20T15:49:37.000Z"},"__v":0}
{"_id":{"$oid":"5a13092259df8d00148be95a"},"author":"Nate Chrisman","title":"NiP takes IEM Oakland against FaZe Clan","body":"In an intense map 5 on Cache, NiP closes up shop against FaZe Clan to win the Intel Extreme Masters, Oakland competition. The 16-10 win for NiP marks an important part of their recent uprising after the many crests and troughs they've had in recent years. \r\n\r\nFrom a series of disappointing tournament losses, to entire rosters moving on to other ventures, NiP has come back with a vengeance, securing wins against not only FaZe Clan, but also SK Gaming, both of which are highly revered teams that are continuously on everyone's hit list. \r\n\r\nAll of IEM Oakland is on the \u003ca href='https://www.twitch.tv/esl_csgo' target='_blank'\u003eESL CS:GO Twitch\u003c/a\u003e, but you can watch the final map here: \r\n\r\n\u003ciframe src=\"https://player.twitch.tv/?autoplay=false\u0026video=v202800773\" frameborder=\"0\" allowfullscreen=\"true\" scrolling=\"no\"\u003e\u003c/iframe\u003e\r\n","sourceLink":"https://www.twitch.tv/esl_csgo","image":"https://i.imgur.com/iDEMdVr.png","imageCaption":"NiP Celebrating Victory","imageSource":"ESL","contentType":"standard","categories":["general","Counter-Strike: Global Offensive"],"published":{"$date":"2017-11-20T16:56:02.451Z"},"__v":0}
{"_id":{"$oid":"5a1310af59df8d00148be95b"},"author":"Nate Chrisman","title":"Here are the brackets for Capcom Cup 2017","body":"Reddit user \u003ca href='https://www.reddit.com/user/CityHunter18' target='_blank'\u003eCityHunter18\u003c/a\u003e has posted what is said to be the brackets for Capcom Cup 2017. It looks like we've got ourselves a competition! With only the last LCQ to be found just prior to Capcom Cup, the brackets are full of the best players SFV currently has to offer. Take a look for yourself! \r\n\r\n\u003cimg src='https://i.imgur.com/BhqQzt8.jpg' alt='Capcom Cup 2017 Brackets'\u003e\r\n\r\n","sourceLink":"","image":"https://i.imgur.com/BLuLVqG.png","imageCaption":"Capcom Cup 2017","imageSource":"Capcom Pro Tour","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-20T17:28:15.000Z"},"__v":0}
{"_id":{"$oid":"5a13129159df8d00148be95c"},"author":"Nate Chrisman","title":"Skadoodle doesn't play around","body":"\u003ciframe src=\"https://clips.twitch.tv/embed?clip=AmericanSucculentPartridgeBrokeBack\u0026autoplay=false\u0026tt_medium=clips_embed\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\"\u003e\u003c/iframe\u003e","sourceLink":"","image":"https://i.imgur.com/rt6FgOb.jpg","imageCaption":"Skadoodle","imageSource":"HLTV","contentType":"video","categories":["general","Counter-Strike: Global Offensive"],"published":{"$date":"2017-11-20T17:36:17.206Z"},"__v":0}
{"_id":{"$oid":"5a1372d8c1be4a00141ba11b"},"author":"Mike Keppler","title":"New Street Fighter V Skins Incoming!","body":"The holiday season is almost among us and it just wouldn't be right without new Street Fighter V skins!  There's some pretty cool skins in this batch such as 'ice queen' Kolin and 'fit' Birdie.  Clearly Capcom absolutely loves Chun-Li (and why wouldn't they?) because she's receiving three more skins on top of the large collection of skins she already has.  Maybe they are teasing to Chun-Li buffs for season 3?  Until that happens, check out all the new skins below!\r\n\r\n\u003cimg src='https://i.imgur.com/uPrRXB6.jpg' alt='Alex'\u003e\r\n\r\n\u003cimg src='https://i.imgur.com/MFdnqCO.jpg' alt='Karin'\u003e\r\n\r\n\u003cimg src='https://i.imgur.com/XbRulKo.jpg' alt='Kolin'\u003e\r\n\r\n\u003cimg src='https://i.imgur.com/D1wb7SF.jpg' alt='Menat'\u003e\r\n\r\n\u003cimg src='https://i.imgur.com/hrRQwKg.jpg' alt='Karin Throwback'\u003e\r\n\r\n\u003cimg src='https://i.imgur.com/u5FmPri.jpg' alt='Balrog Throwback'\u003e\r\n\r\n\u003cimg src='https://i.imgur.com/vgbSZbL.jpg' alt='Birdie Throwback'\u003e\r\n\r\n\u003cimg src='https://i.imgur.com/V9jSqWp.jpg' alt='Chun 1'\u003e\r\n\r\n\u003cimg src='https://i.imgur.com/vQJu2F9.jpg' alt='Chun 2'\u003e\r\n\r\n\u003cimg src='https://i.imgur.com/XMypyzG.jpg' alt='Chun 3'\u003e","sourceLink":"https://www.gamer.ne.jp/news/201711200032/","image":"https://i.imgur.com/uPrRXB6.jpg","imageCaption":"Alex","imageSource":"Capcom","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-21T00:27:04.000Z"},"__v":0}
{"_id":{"$oid":"5a13afebc1be4a00141ba11c"},"author":"Nate Chrisman","title":"Mayhem v. Fusion Preseason Matchup","body":"Starting off the Overwatch League preseason matches is the Florida Mayhem v. Philadelphia Fusion matchup. There are quite a few differences between these two teams. Since there isn’t a lot of statistical data on the teams as a whole, we’re going to take a look at what’s out there and see what we might be able to infer on an individual player basis. \r\n\r\n\u003ch3 style='text-align: center'\u003eTeam Composition\u003c/h3\u003e\r\n\r\nMayhem is the only team in the entire Overwatch League that has the minimum required number of players:  6. So they better be stacked. Let’s see what we have!\r\n\r\nAlthough knowing each player’s home country isn’t all that informative on it’s own, we can combine that knowledge with whether or not the player competed in the Overwatch World Cup on their respective country’s team. This will give us an indication of whether or not the player in question is one of the top in the country.\r\n\r\nOf the six players, four of them are from Sweden, one from Belgium, and one from Finland. \r\n\r\nSweden: Manneten*, TviQ*, Zebbosai*, CWoosH*\r\nBelgium: Logix*\r\nFinland: Zuppeh* \r\n\r\n*competed in OWWC\r\n\r\nSo, 100% of the team competed in the world cup. These players are among the top in their respective countries, so putting all players of this caliber on the same team could be dangerous for their opponent. It’s interesting, because a lot of other teams in the OWL don’t have much more than half of their players who competed in the OWWC. This isn’t to say that they aren’t solid players (that would be ridiculous), but having the chops to compete in the OWWC might give a little more edge than one might think.\r\n\r\nIn terms of roles (which can always change as time goes on), 1/3 is DPS, 1/3 is Support, and 1/3 is Flex, so it seems like they have all the bases covered, but the cohesion between them is going to have to be on point, seeing as they don’t have the ability to swap anybody out during game time. They have no other choice but to work together as a team of 6 and only 6. \r\n\r\nAs for Philadelphia Fusion, there is a little more diversity in terms of player home countries, but that comes with having 12 members as opposed to 6. Here is the breakdown:\r\n\r\nSouth Korea: Carpe, DayFly, Hotba, SADO\r\nCanada: Joemeister*\r\nUnited Kingdom: Boombox*\r\nSweden: Snillo*\r\nFinland: fragi*\r\nIsrael: Eqo*\r\nRussia: ShaDowBurn*\r\nSpain: Neptuno*\r\nFrance: Poko\r\n\r\nAs for Fusion, 58% of the team competed in the world cup. However, the players who didn’t compete do have a notable past in the competitive arena. As far as role composition, 1/3 of the team is Support, 1/3 is DPS, 1/6 is Defense/Tank, and 1/6 is Flex. With a pretty even spread for player roles, they definitely have more flexibility as far as being able to change up their meta on the fly. They have at least 2 players in each role that specialize in said roles. The flex players for both teams obviously can adapt and play what is needed, but sometimes having a solid specialty in a hero type can really make the difference. \r\n\r\nA team should be a well-rounded group of specialized players, not a group of well-rounded players (there is a difference), and I think Fusion fulfills that pretty well. \r\n\r\n\r\n\u003ch3 style='text-align: center'\u003eWin Rates\u003c/h3\u003e\r\n\r\nNow, I want to say a little bit of a disclaimer about this section before anyone takes it too seriously. Obviously, as a team there have been no competitive matches yet, so the win rates and other quantitative data as a team have not been recorded. That being said, I just took a quick look at GosuGamers and researched each individual player. I took the win rates from those player pages and averaged them into a “Team Average” Win Rate.\r\n\r\nSo it’s pretty much just for kicks at this point, but once things start happening, you’ll get a full blown quantitative analysis of the teams from me, I promise. \u003ca href=’ http://www.gosugamers.net/’ target=’_blank’\u003eGosuGamers\u003c/a\u003e puts pretty decent effort into recording team and player statistics, so let’s see what we have for now. \r\n\r\nFor Mayhem, these are the win rates on a per player basis via GosuGamers: \r\n\r\nManneten:  64%\r\nTviQ: 79%\r\nZebbosai: 71%\r\nCWoosH: 72%\r\nLogix: 70%\r\nZuppeh: 76%\r\n\r\nThis makes Mayhem’s team average win-rate at 72%, which isn’t too bad and seems to be a reasonable ballpark for high level players. \r\n\r\nAs for Fusion, since they have 12 players (one of which doesn’t have any stats on GosuGamers), what I did was take the top 6 win rates from the team and calculate the average that way. Some players had some outliers in terms of stats, which would’ve thrown the average way off, but most of the players were in the same ballpark as the lower 3 players on the list I made below:\r\n\r\nBoombox – 80% \r\nDayFly – 75% \r\nFragi – 71% \r\nSnillo – 70% \r\nNeptuno – 65% \r\nShadowburn – 64% \r\n\r\nThat makes the average pretty damn close to Mayhem at 70.8%. \r\n\r\n\u003ch3 style='text-align: center'\u003eMatch Prediction\u003c/h3\u003e\r\n\r\nTaking everything into account (except for win-rates), it’s safe to say that this is going to be an interesting match. Constraints on Mayhem in regards to player availability can be seen as an Achilles heel if Fusion reads them well enough. However, I personally see it as a strength as they’re going to be focused on making things happen with the limited resources they have – making diamonds from the pressure/heat, so to speak \r\n\r\nFusion does have more players that are specialized in their respective hero classes. For example, Mayhem does not have any tank/defense only players, only flex to fill in the gaps, whereas Fusion has the ability to place specialized people in situations that may require that extra ‘umph’. \r\n\r\nI’m anticipating a neck and neck match for Mayhem v. Fusion, but I honestly think that Mayhem is going to pull through on this one in the end. We’ll just have to wait and see!  \r\n","sourceLink":"","image":"https://i.imgur.com/uQ3pqoR.png","imageCaption":"Mayhem v. Fusion","imageSource":"Logos from Blizzard Entertainment","contentType":"standard","categories":["general","Overwatch League","Overwatch","Florida Mayhem","Philadelphia Fusion"],"published":{"$date":"2017-11-21T04:47:39.083Z"},"__v":0}
{"_id":{"$oid":"5a1449e5c1be4a00141ba11d"},"author":"Nate Chrisman","title":"Get your fix on 'Blizzard World' - now on the PTR","body":"If BlizzCon wasn't enough of a wonderland of Blizzard IP for you (we always want more!), then you can now play Overwatch's new map 'Blizzard World' on the PTR. \r\n\r\nAnnounced at BlizzCon this year, the new map is a 'theme park' hybrid with all of the Blizzard content that your heart could ever desire! You'll see the likes of World of Warcraft, StarCraft, Heroes of the Storm, Hearthstone, and Diablo - all worlds that exist in the Overwatch universe. \r\n\r\n\u003chr\u003e\r\n\u003ciframe src=\"https://www.youtube.com/embed/Ii3Hce3_fOw?rel=0\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\n\u003chr\u003e\r\n\r\nIt looks like we're going to have a whole new set of issues when it comes to people staying focused on the objectives, because it looks stellar! \r\n\r\nWhat's next, an actual Blizzard theme park for all of us to attend? We can only hope! \r\n\r\n","sourceLink":"","image":"https://i.imgur.com/tO8NGIe.jpg","imageCaption":"Blizzard World ","imageSource":"Blizzard Entertainment","contentType":"standard","categories":["general","Overwatch"],"published":{"$date":"2017-11-21T15:44:37.278Z"},"__v":0}
{"_id":{"$oid":"5a15a9156b34ce0014112ebe"},"author":"Nate Chrisman","title":"'HugS' shows us just how big #21 in SSB is","body":"From an outside point of view, sometimes its hard to gauge how big certain communities are. For example, if you like to watch esports, but mainly watch something like CS:GO or Overwatch, you'll have an understanding of how big those communities are. Sometimes, though, you lose sight of the other communities that are an integral part in making the Esports Community (ESC) as big as it is, ever increasing in size. \r\n\r\nSo if you don't follow Smash Bros., here is a great example. HugS, who has been active in the Smash community since about 2004, posted some of his stats on \u003ca href='https://twitter.com/HugS86' target='_blank'\u003ehis Twitter\u003c/a\u003e. He has a lot to offer when it comes to being a free agent.\r\n\r\nAs of July 2017 alone, HugS has placed 17th in Genesis 4, 5th in CEO Dreamland, 13th in Dreamhack Austin, and 5th in Battle of BC 2, just to name a few of the majors. \r\n\r\n\u003chr\u003e\r\n\u003cimg src='https://i.imgur.com/cUHmob2.jpg' alt='HugS Super Smash'\u003e\r\n\u003chr\u003e\r\n\r\nThese are some fantastic standings, and obviously he's a very highly skilled and respected player, but what about the other numbers, you ask? How many people does he pull on stream? What about subscribers? Do people even watch this stuff? Oh, yes. You're definitely mistaken if you think otherwise. Let me tell you why.\r\n\r\nAgain, as of July 2017 alone, HugS' Twitch stream has 3.5 million viewer minutes watched, 600,000 channel views, 50,000 unique viewers, and 3,110 subscriptions sold. All in a tidy 261.9 hours of streaming. That's about 32 work days. If you worked 5 days a week, 8 hours a day, thats only 6 1/2 weeks of work. That's just the stream alone, imagine what else he's been up to with tournaments and offline play! Basically, he's killin' it. \r\n\r\n\u003chr\u003e\r\n\u003cimg src='https://i.imgur.com/zjk4nV9.jpg' alt='HugS Super Smash'\u003e\r\n\u003chr\u003e\r\n\r\nGreat stats, HugS! #21 ain't such a bad place to be in! Keep up the great work.","sourceLink":"https://twitter.com/HugS86/status/933054202946904064","image":"https://i.imgur.com/iOGUI87.jpg","imageCaption":"HugS at Genesis 4","imageSource":"Robert Paul Photography","contentType":"standard","categories":["general","Super Smash Bros. Melee"],"published":{"$date":"2017-11-22T16:43:01.495Z"},"__v":0}
{"_id":{"$oid":"5a15bc286b34ce0014112ebf"},"author":"Mike Keppler","title":"New Fighters Coming to Marvel vs Capcom: Infinite","body":"Yesterday, we got our first glimpse of the new fighters that will be coming to Marvel vs Capcom: Infinite on December 5.  Announced shortly after the game initially came out, we know the second half of the first season would include Winter Solider, Black Widow and Venom (and tipping the roster in Marvel’s favor!).  Now we can see them in action for the first time as seen in the video below.\r\n\r\nThe new characters look pretty cool in my opinion.  Winter Soldier looks like a crazier Chris Redfield with the ability to walk through enemy specials by just blocking it with is arm (something I think Captain A should be able to do with his shield).  Although I think we can all agree that Winter Soldier sounds a little emo when he activates his special and let’s go a “JUST LEAVE ME ALONE!”  Black Widow looks like a much faster Gamora which from the looks of it will give her plenty of options to confuse her opponents and break through their defenses.  Lastly we have Venom who looks to be pretty similar to his MVC2 counter-part by being able to transform into black symbiote goo to attack his enemies.\r\n\r\nYou’ll be able to play these characters in a couple weeks when the release on December 5.  Until then, enjoy the trailer!\r\n\r\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/04oBawHYlHw\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\n","sourceLink":"https://www.youtube.com/watch?v=3KT-rjVkxHY","image":"https://i.imgur.com/cJrWuda.jpg","imageCaption":"It's Mahvel, Baby!","imageSource":"Capcom","contentType":"standard","categories":["general","Marvel vs. Capcom: Infinite"],"published":{"$date":"2017-11-22T18:04:24.000Z"},"__v":0}
{"_id":{"$oid":"5a15be2e6b34ce0014112ec0"},"author":"Nate Chrisman","title":"$370,000+ prize pool, more DLC available via Capcom Cup ","body":"The initial prize pool of $250,000 for the top 8 to split at Capcom Cup has now been increased by a bonus contribution of $120,000 - making the total prize pool $370,000. It's possible that more bonus contributions could come about! \r\n\r\nAlso, according to popular demand, both CPT 2017 and CPT 2016 DLC is now available for you to empty your pockets on. So that means the following stuff is available:\r\n\r\n\u003ch3 style='text-align: center'\u003eCapcom Pro Tour 2016 Pack – $9.99\u003c/h3\u003e\r\n\u003cul\u003e\r\n\u003cli\u003eAdditional Costume (“Capcom Pro Tour”): Chun-Li\u003c/li\u003e\r\n\u003cli\u003eAdditional Costume (“Capcom Pro Tour”): Cammy\u003c/li\u003e\r\n\u003cli\u003eAdditional Costume (“Capcom Pro Tour”): Necalli\u003c/li\u003e\r\n\u003cli\u003eCapcom Pro Tour 2016 Stage: “Ring of Destiny”\u003c/li\u003e\r\n\u003cli\u003e1 exclusive CPT themed color option for all 22 characters (PS4 only)\u003c/li\u003e\r\n\u003cli\u003e2 Exclusive Titles: “Capcom Cup 2016” and “Capcom Pro Tour 2016” (PS4 only)\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\n\u003cimg src='https://i.imgur.com/JIfPN05.jpg' alt='Capcom Pro Tour DLC 2017'\u003e\r\n\r\n\u003ch3 style='text-align: center'\u003eCapcom Pro Tour 2017 Pass — $24.99\u003c/h3\u003e\r\n\u003cul\u003e\r\n\u003cli\u003eAdditional Costume (“Capcom Pro Tour”): Ryu\u003c/li\u003e\r\n\u003cli\u003eAdditional Costume (“Capcom Pro Tour”): Ken\u003c/li\u003e\r\n\u003cli\u003eAdditional Costume (“Capcom Pro Tour”): Champion’s Choice Costume – Guile\u003c/li\u003e\r\n\u003cli\u003eCapcom Pro Tour Stage: “Ring of Pride”\u003c/li\u003e\r\n\u003cli\u003e1 exclusive CPT-themed color option for all 28 characters\u003c/li\u003e\r\n\u003cli\u003e2 Titles: “Capcom Cup 2017” and “Capcom Pro Tour 2017”\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\nSo get your wallet out! Remember kids, skins are always more important than anything else. \r\n\r\nAlso, don't miss out on watching \u003ca href='https://www.twitch.tv/capcomfighters' target='_blank'\u003eCapcom Cup on Twitch!\u003c/a\u003e :) ","sourceLink":"https://blog.us.playstation.com/2017/11/22/capcom-cup-2017-finalists-to-compete-for-prize-pool-of-over-370k/","image":"https://i.imgur.com/4tGssoi.jpg","imageCaption":"Guile","imageSource":"Capcom Pro Tour","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-22T18:13:02.566Z"},"__v":0}
{"_id":{"$oid":"5a15cf7b9d8e8a00149d77bf"},"author":"Mike Keppler","title":"Last Chance Qualifier for Capcom Cup!","body":"Capcom Cup 2017 is just around the corner and there's only one slot open!  What does this mean, you ask?  It means there will be a Last Chance Qualifier (LCQ) event right before the Capcom Cup officially kicks off!\r\n\r\nLCQ matches will take place on December 8th and will be completely free to attend.  If you happen to be in Anaheim that day and would like a shot at fame and the Capcom Cup, \u003ca href=\" https://smash.gg/tournament/capcom-cup-sfv-last-chance-qualifier\" target=\"_blank\"\u003e registration\u003c/a\u003e is open to everybody and costs $20.  Make note that the LCQ event will be capped at 256 players so be sure to register ASAP to reserve your spot in the tournament.\r\n\r\nThere will be tons of competition to earn the final spot in the Capcom Cup 32 player \u003ca href=\"https://www.esportsterminal.com/news/5a1310af59df8d00148be95b\" target=\"_blank\"\u003ebracket\u003c/a\u003e.  Here’s a list of notable players who are currently registered for the LCQ:\r\n\r\n\u003cul\u003e\r\n\u003cli\u003eNyChrisG\u003c/li\u003e\r\n\u003cli\u003eFchamp\u003c/li\u003e\r\n\u003cli\u003eMOV\u003c/li\u003e\r\n\u003cli\u003eBrian_F\u003c/li\u003e\r\n\u003cli\u003eINFILTRATION\u003c/li\u003e\r\n\u003cli\u003eXsK_Samurai\u003c/li\u003e\r\n\u003cli\u003ePR-Balrog\u003c/li\u003e\r\n\u003cli\u003eNemo\u003c/li\u003e\r\n\u003cli\u003eAlex Myers\u003c/li\u003e\r\n\u003cli\u003eRicki Ortiz\u003c/li\u003e\r\n\u003cli\u003eTHE COOL KID93\u003c/li\u003e\r\n\u003cli\u003egllty\u003c/li\u003e\r\n\u003cli\u003eAnd many more…\u003c/li\u003e\r\n\u003c/ul\u003e\r\n\r\nOne of the big entries that took me by surprise is Ricki Ortiz given I haven’t seen much of her in season 2.  She placed #2 last year right behind Nuckledu at the 2016 Capcom Cup and I’m glad she’s going to compete in the LCQ for another shot at the big prize.  Whoever ends up winning the LCQ will already have a tough start since they will have to face-off against Punk who is currently sitting at the #1 spot in the current standings (at 3080 points).\r\n\r\nWe have a lot of great Street Fighter to watch in the coming weeks and I can say there has never been a better time to get into it as a spectator or player (especially with the Arcade Edition releasing early next year).\r\n\r\nHappy Street Fighting (in the game of course)!\r\n\r\n","sourceLink":"https://capcomprotour.com/capcom-cup-2017-last-chance-qualifier-open-register-now/ image","image":"https://i.imgur.com/pIUe9uA.jpg","imageCaption":"Get Hype!","imageSource":"Capcom Pro Tour","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-22T19:26:51.000Z"},"__v":0,"subTitle":"Time to get in now!"}
{"_id":{"$oid":"5a1708e39d8e8a00149d77c0"},"author":"Nate Chrisman","title":"Justin Wong clearly likes the pain Idom was dealing","body":"\u003ciframe src=\"https://clips.twitch.tv/embed?clip=BoredSteamyLaptopTTours\u0026autoplay=false\u0026tt_medium=clips_embed\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"true\"\u003e\u003c/iframe\u003e","sourceLink":"","image":"https://i.imgur.com/1On3zff.png","imageCaption":"Idom/Justin Wong","imageSource":"Twitch","contentType":"video","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-23T17:44:03.585Z"},"__v":0}
{"_id":{"$oid":"5a18522a656a050014470910"},"author":"Nate Chrisman","title":"Coach Profile: David Pei (LA Gladiators)","body":"As we all know, coaches are the cornerstone to making a team perform at their best. They see the potential in their individual team members as well as the entire team as a whole. Their job is to dig deep and make those unique talents resonate. The Los Angeles Gladiators will need that more than ever, especially since they are competing with that \u003ci\u003eother\u003c/i\u003e team in the LA area. \r\n\r\nWell, the Gladiators are surely grateful that David Pei is leading the way for them. Pei has experience as a top 50 semi-pro League of Legends player, where he says his interest in esports stems from, in an interview done by \u003ca href='https://www.overwatchscore.com/overwatch-league-teams/los-angeles-gladiators/interview-los-angeles-gladiators-coach-david-pei/' target='_blank'\u003eOverwatch Score\u003c/a\u003e. His love for playing Overwatch drew him to coaching opportunities for Splyce (disbanded as of \u003ca href='https://www.youtube.com/watch?v=rX9chE2bbuQ' target='_blank'\u003eMay 2017\u003c/a\u003e). \r\n\r\n\u003chr\u003e\r\n\u003cimg src='https://i.imgur.com/Opt5BMi.jpg' alt='David Pei LA Gladiators Coach'\u003e\r\n\u003chr\u003e\r\n\r\nAfter Splyce, Pei moved to Kungarna, which had iRemiix, babybay, and Bischu on the team, who are also a part of the Overwatch League. In fact, iRemiix and Bischu are on the \u003ca href='https://www.esportsterminal.com/overwatch-league/team/5a08ef7d56b7e71ca1f767a8' target='_blank'\u003eGladiators roster\u003c/a\u003e, while babybay is on \u003ca href='https://www.esportsterminal.com/overwatch-league/team/5a08fb88560ce21cde602020' target='_blank'\u003eSan Francisco Shock\u003c/a\u003e. \r\n\r\nNeedless to say, Pei has been around for quite some time and is well known within the scene for his coaching abilities. He isn't scared of competing against \u003ca href='https://www.esportsterminal.com/overwatch-league/team/5a08f1fa56b7e71ca1f767b0' target='_blank'\u003eValiant\u003c/a\u003e for the LA spotlight, either. In an interview done by \u003ca href='https://www.heroesneverdie.com/2017/11/2/16598788/los-angeles-gladiators-coach-roster-announcement' target='_blank'\u003eheroesneverdie.com\u003c/a\u003e he stated that LA is the ideal place, seeing as it's \"kind of a melting pot of all different cultures\" and it's \"the epicenter of esports and I think our team will represent them well.\"\r\n\r\nDavid Pei not only has the experience in esports, both as a player and a coach, but most definitely has the coaching mindset that will take Gladiators far. He seems to have a deep understanding of his team even at this early point in the game. We're excited to see where the Gladiators can go with David Pei carving out their place in Overwatch esports!\r\n\r\nIf you'd like to follow David, check out his \u003ca href='https://www.twitter.com/dpei_ow' target='_blank'\u003eTwitter\u003c/a\u003e. Be sure to check back on EST frequently for updates as we get the preseason started! \r\n\r\n","sourceLink":"","image":"https://i.imgur.com/Xo9bZ9D.png","imageCaption":"Gladiators Logo","imageSource":"gladiators.overwatchleague.com","contentType":"standard","categories":["general","Overwatch League","Overwatch","Los Angeles Gladiators"],"published":{"$date":"2017-11-24T17:08:58.000Z"},"__v":0,"subTitle":"The force behind the Gladiators"}
{"_id":{"$oid":"5a18af31f291df00144b575f"},"author":"Mike Keppler","title":"ARMS 'Party Crash' Results Are In!","subTitle":"The first ever ARMS event has come to a one-sided conclusion","body":"The results for the first ARMS 'Party Crash' are in.  With a rather large lead, Spring Man wins the event with a crushing 62% win rate while Ribbon Girl came in with 38%.  Here's what the ARMS twitter account had to say about the result!\r\n\r\n[Using the magic of Google Translate...]\r\n\u003cstrong\u003e\r\n\"Party Jack \"The Dream's Leading Showdown!\"\r\nSpringman wins from 62% - 38%! Congratulations Springman!\r\nRibbon girl of Mr. Watase was also a great fight ... Uoo.\r\nHowever, this should have taken up Springman's data a lot .... If weak points are found, it will be fine next time!\"\r\n\u003c/strong\u003e\r\nUoo!  The translation is quite poetic, don't ya think?  Good games for all who participated even if our best girl didn't quite make the cut.  Hopefully we'll see more of these 'Party Crash' events in the near future!","sourceLink":"https://twitter.com/ARMS_Cobutter/status/934005257335595009","image":"https://i.imgur.com/6nPxUU5.jpg","imageCaption":"The Results Are In!","imageSource":"ARMS Twitter","contentType":"standard","categories":["general","ARMS"],"published":{"$date":"2017-11-24T23:45:53.000Z"},"__v":0}
{"_id":{"$oid":"5a19e75d929e93001479f0ae"},"author":"Mike Keppler","title":"Coach Profile: Dae-hee Park (Boston Uprising)","subTitle":"A quick look into the man coaching the Boston Uprising","body":"Former League of Legends player now turned into Boston Uprising's head coach, Dae-hee \"Crusty\" Park is aiming to surprise the Overwatch League with his surprise team picks.  Instead of recruiting pure, raw talent for the team, Park prefers to find players who have great potential but haven't proven themsevles yet.  In a sense, the players that make up the Boston Uprising could be called amateurs (at least compared to the other OWL teams).  This could be good or bad depending on your point of view.  Since these players are still developing their skill sets within Overwatch, they have plenty of room to be molded into a destructive force by the coaching staff.  On the other hand, the team could be vastly outmatched/overwhelmed by the more experienced players in the league.  One of the requirements that each player on the team had to meet is being \"coachable\" as Park said in an interview with \u003ca \r\ntarget=\"_blank\" href=\"https://www.overwatchscore.com/overwatch-league-teams/boston-uprising/interview-boston-uprising-coach-da-hee-crusty-park/\"\u003eoverwatchscore.com\u003c/a\u003e.  This is a great road to take with the roster since it'll truly give the coaching staff the opportunity to mold these young players into something great.\r\n\r\nPark's team picks are also very interesting since most of the players come from different cultural backgrounds.  There's six different cultures that make up the Boston Uprising (seven if you include the coaching stuff) which in itself is a very difficult problem to solve and overcome.  While this may seem like a move that will hurt the team more than help, Park has a different opinion on the matter.  While the language problem will be a problem to overcome, Park hopes to take the different play styles on his diverse team and blend them together to perhaps come up and execute strategies that we have not yet seen in professional Overwatch play.  An example that Park gives is Koreans tend to use Winston and D.va aggressively while North Americans tend to play their games on the safer side.\r\n\r\nThe community and analysts have been critical on the choices that Park has made regarding the roster, but if it's one thing to take away from Park, it's his confidence.  Park is very sure that his team will be difficult to beat and may even surprise people once the official season starts.  Even in Park's past, he's built Overwatch teams from lesser known players and has taken them to greater heights such as the Nexus Cup and APEX.\r\n\r\nLooks like we'll find out if Park's decisions pay off when the inaugural season of Overwatch begins January 10, 2018.","sourceLink":"","image":"https://i.imgur.com/wtSDRBb.jpg","imageCaption":"Will Dae-hee Park make Boston rise up?","imageSource":"Boston Uprising","contentType":"standard","categories":["general","Overwatch League","Overwatch","Boston Uprising"],"published":{"$date":"2017-11-25T21:57:49.000Z"},"__v":0}
{"_id":{"$oid":"5a1a060d929e93001479f0af"},"author":"Nate Chrisman","title":"EST Interview: THE COOL KID93 talks Capcom Cup, his relationship, and the origins of his Street Fighter career","subTitle":"If you get the chance to fight him, be prepared.","body":"After taking first place at the Red Bull Proving Grounds in Chicago, Marcus Redmond, who you might recognize as THE COOL KID93, went on to compete in the \u003ca href='https://smash.gg/tournament/red-bull-battle-grounds-2017-1/details' target='_blank'\u003eRed Bull Battlegrounds\u003c/a\u003e in Boston about a week ago. Well known for his Alex, Rashid, and now being called the “best Abigail player in the USA” by PoongKo, he’s carving out his place in competitive Street Fighter as he charges through competitions, placing high with relative ease. \r\n\r\n\u003cimg src='https://i.imgur.com/phZNTku.png' alt='PoongKo Twitter'\u003e\r\n\r\nWe had the chance to speak with THE COOL KID93 about his expectations for the Capcom Cup LCQ, how he and his wife stay on top of their game, and how his Street Fighter career came to be.  \r\n\r\n\u003chr\u003e\r\n\r\n\u003cstrong\u003eEST: \u003c/strong\u003eWas there a defining moment that sparked your interest in Street Fighter?\r\n\r\n\u003cstrong\u003eTHE COOL KID93:\u003c/strong\u003e So I’ve been playing games all my life. Games like Super Mario 64, WWF: No Mercy, Here Comes the Pain, etc., but I never really was a fighting game person when I was younger. The reason I actually started playing fighting games was because my friend’s mother broke his WWE game, so she made it up to him and bought him SF4 instead. I didn’t care about SF, but he kept telling me to give it a try and so I did. Day by day I started enjoying myself more and more. Then eventually I actually bought the game myself and started playing from there. So that’s how I actually started getting into fighting games overall. \r\n\r\n\u003cstrong\u003eEST: \u003c/strong\u003eIs there a story about the time in your life that made you want to compete professionally, or was it always on your radar?\r\n\r\n\u003cstrong\u003eTHE COOL KID93:\u003c/strong\u003e It was always on my radar, but I was always scared because I figured the Japanese players would destroy me and it’s no point to even try [laughing]. I was also scared of players in America, too. [The] problem I used to have was that I doubt myself. Still kind of do that now at times. But then I end up doing it and being real good at it. \r\n\r\nI originally tried college once I graduated, but I felt like I wasn’t taking control of my life and doing basically what society says. I didn’t want to do it, but I felt like I had to. I never knew where to start when it came to competing as well. \r\n\r\n\u003cstrong\u003eEST:\u003c/strong\u003e Your wife Joy is clearly very passionate about your success. It’s rare to see that kind of support. You two are definitely a power couple! So, what's the secret to being like Marcus and Joy? Any unique challenges being a power couple in the FGC?\r\n\r\n\u003cstrong\u003eTHE COOL KID93:\u003c/strong\u003e The only challenge I would say is balancing out everything. I work as well outside of Esports. So I have to balance spending enough time playing the game and getting in a good amount of practice, but not neglecting my wife at the same time. It’s a challenge but the more we do it the easier it is. When tournaments are rolling around she understands that I gotta play more than usual so I can practice and be sharp. \r\n\r\n\u003cstrong\u003eEST: \u003c/strong\u003eHas she ever beat you in Street Fighter?\r\n\r\n\u003cstrong\u003eTHE COOL KID93: \u003c/strong\u003eWe never played in SF, but I’m sure she’ll win [laughing]. No doubt. One day I will try to get her to learn a bit about the game. As long as she has the patience to deal with it [laughing].\r\n\r\n\u003cstrong\u003eEST: \u003c/strong\u003eJust the other day, PoongKo said on Twitter that you were the best Abigail player in the USA and that he wants to fight you. I don’t think many people would disagree with that at this point. How do you feel about that title?\r\n\r\n\u003cstrong\u003eTHE COOL KID93: \u003c/strong\u003eIt’s an honor to think that people actually see me as the best with Abigail. But I’m not really worried about being the best with a character anymore. What is the point of being the best with a character if you don’t win nothing? My main focus is to win and do my best. Getting wrapped up in trying to show people you’re the best with a character will only give you a headache [laughing]. Just go out there and do work.\r\n\r\n\u003cstrong\u003eEST: \u003c/strong\u003eHow do you think the match up with PoongKo would go?\r\n\r\n\u003cstrong\u003eTHE COOL KID93: \u003c/strong\u003eI don’t really like to say whether or not I’m going to beat someone, because if they end up winning then I am the one looking silly [laughing]. We played before at Combo Breaker, but that was way before Abigail was even created. \r\n\r\n\u003cstrong\u003eEST: \u003c/strong\u003eYou clearly have what it takes to make it past the LCQ in Anaheim, but what, or maybe who, do you think will be your biggest challenge there?\r\n\r\n\u003cstrong\u003eTHE COOL KID93: \u003c/strong\u003eThere are a lot of players that I haven’t fought before that are in this tournament. I’m going to do my best and look them all up so I don’t be surprised at what I see come December 8th. One of my biggest challenges is for me to catch on to habits and styles right away. That’s something I feel is much needed in fighting games. Or any competitive game, honestly.\r\n\r\n\u003cstrong\u003eEST: \u003c/strong\u003eThere is a $370,000 prize pool on the line. It’s a lot of money, so I have to ask, what would you do with your share of the cash?\r\n\r\n\u003cstrong\u003eTHE COOL KID93: \u003c/strong\u003eLord willing, if I were to win all that money I am definitely putting some money into the church. Giving my wife some money, paying up some bills and giving my parents some money as well. Then the rest I would more than likely put into a savings account. \r\n\r\n\u003chr\u003e\r\n\r\nIf you’re not following THE COOL KID93 anywhere, you should be! Give him a follow on his \u003ca href='https://twitter.com/Redmond2393' target='_blank'\u003eTwitter\u003c/a\u003e, he's constantly uploading videos to his \u003ca href='https://www.youtube.com/user/marcusredmond1993' target='_blank'\u003eYouTube channel\u003c/a\u003e, and is on \u003ca href='https://www.twitch.tv/the_cool_kid93' target='_blank'\u003eTwitch\u003c/a\u003e as well. \r\n","sourceLink":"","image":"https://i.imgur.com/q9KK6ku.png","imageCaption":"Taking his victory","imageSource":"Red Bull","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-26T00:08:45.000Z"},"__v":0}
{"_id":{"$oid":"5a1b1ab75fe3540014dc0ff1"},"author":"Nate Chrisman","title":"Allegiance signs 'Laura Scientist' 801 Strider","subTitle":"The 3rd FGC addition to the team","body":"Team Allegiance, which has stakes in many different esports games right now, has just added a 3rd member to their fighting game division: 801 Strider | Gustavo Romero. Currently sitting at #29 on the CPT with 795 points, we'll be seeing him at the Capcom Cup in a couple of weeks, facing Yukadon in his first match. \r\n\r\nHe recently placed 5th in the North America Regional Finals at Red Bull Battle Grounds, where he faced THE COOL KID93 for a 1-3 victory, but you may have also seen him at other notable tournaments this year such as Canada Cup, Northwest Majors, and SoCal Regionals, where he placed high in the ranks. \r\n\r\n\u003chr\u003e\r\n\u003cimg src='https://i.imgur.com/yS9c55h.jpg' alt='801 Strider Capcom Cup 2015'\u003e\r\n\u003chr\u003e\r\n\r\n801 Strider is deserving of a solid sponsor, so it's great that he is now a part of Allegiance. We're excited to see 801 Strider and his Laura kick ass and take names with the Allegiance name behind them. \r\n\r\nCheck out Allegiance and 801 Strider on Twitter here: \r\n\r\n\u003ca href='https://twitter.com/TeamAllegiance' target='_blank'\u003eAllegiance\u003c/a\u003e\r\n\u003ca href='https://twitter.com/801_Gustavo' target='_blank'\u003e801 Strider\u003c/a\u003e\r\n\r\nIf you'd like to rep some Allegiance gear and show some support, just head on over to the \u003ca href='https://store.allegiance.team/' target='_blank'\u003eAllegiance Shop\u003c/a\u003e. \r\n\r\n","sourceLink":"https://twitter.com/TeamAllegiance/status/934580035930947584","image":"https://i.imgur.com/73IQhUN.png?1","imageCaption":"Be sure to keep eye contact","imageSource":"Allegiance Twitter","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-26T19:49:11.000Z"},"__v":0}
{"_id":{"$oid":"5a1b646f5fe3540014dc0ff2"},"author":"Mike Keppler","title":"Marvel vs. Capcom: Infinite Balance Patch Incoming!","subTitle":"Capcom is changing up the game on December 5!","body":"On December 5, MVC:I is receiving its first (and much needed) big balance patch alongside the new \u003ca target=\"_blank\" href=\"http://www.esportsterminal.com/news/5a15bc286b34ce0014112ebf\"\u003eDLC characters\u003c/a\u003e\r\n\r\nA quick glance through the patch notes shows there will be big changes regarding the Reality Stone Infinity Surge (nerf!), Dante (buff.  Just kidding, massive nerf!) and Dormammu (nerf!).  Another big change that's going to be a game changer (literally!) is a hard limit on how many times an opponent can be launched into the air from a single combo.  Next Tuesday, gone are the days where players can easily spam the Reality Stone to poke/interrupt opponents or performing 200+ hit combos with constant air launches (even though they are quite the spectacle to witness).\r\n\r\nA lot of the Dante changes have to deal with a good majority of his moves doing less damage, having fewer active frames, inflicting less stun decay and preventing Dante from facing his opponent when transitioning into a wide array of his abilities.\r\n\r\nIf you would like to see the full detailed patch notes, click the source link below to get the scoop.","sourceLink":"http://www.capcom-unity.com/strumslinger/blog/2017/11/16/patch-notes-for-marvel-vs-capcom-infinite-december-5-update","image":"https://i.imgur.com/idXOUmB.png","imageCaption":"And let it be known that on Dec 5, Capcom pulled out the nerf bat.","imageSource":"Capcom","contentType":"standard","categories":["general","Marvel vs. Capcom: Infinite"],"published":{"$date":"2017-11-27T01:03:43.947Z"},"__v":0}
{"_id":{"$oid":"5a1c41f40e14fc001434f55c"},"author":"Nate Chrisman","title":"Weekend Recap: Nov 24 - Nov 26","subTitle":"A quick rundown of EST's weekend news","body":"A lot went on this weekend on EST in quite a few different areas. Starting with the most recent updates and working backwards: \r\n\r\n\u003ch3\u003eMarvel v. Capcom: Infinite\u003c/h3\u003e\r\nThe very first \u003ca href='https://www.esportsterminal.com/news/5a1b646f5fe3540014dc0ff2' target='_blank'\u003epatch/balance update notes\u003c/a\u003e were released for MVCi, essentially nerfing everything. There were some simple bugs in terms of damage scaling and the game's soundtrack, but mostly the update is about increasing startup frames/decreasing active frames of the Reality/Space stones. An entire host of fighters also received the nerf bullet, such as Dante, Strider, Captain America, etc. \r\n\r\n\u003ch3\u003eStreet Fighter V\u003c/h3\u003e\r\nAn FGC favorite of ours known as the 'Laura Scientist', 801 Strider, was \u003ca href='https://www.esportsterminal.com/news/5a1b1ab75fe3540014dc0ff1' target='_blank'\u003esigned to Allegiance\u003c/a\u003e, giving him the ability to pair up with solid sponsor. He said that he's very excited about this new venture of his and will be training even harder. So we can't wait to see what happens at Capcom Cup! \r\n\r\nWe also had the chance to interview THE COOL KID93, who captured a lot of attention at Red Bull Proving Grounds in Chicago followed by his killer performance at Red Bull lBattle Grounds in Boston. Check out what he had to say \u003ca href='https://www.esportsterminal.com/news/5a1a060d929e93001479f0af' target='_blank'\u003ein our interview\u003c/a\u003e.\r\n\r\n\u003ch3\u003eOverwatch\u003c/h3\u003e\r\nThe preseason is only a couple of weeks away, so everybody in the Overwatch League has been busy preparing for that. We did a couple of Coach Profiles on \u003ca href='https://www.esportsterminal.com/news/5a19e75d929e93001479f0ae' target='_blank'\u003eDa-hee Park (Boston Uprising)\u003c/a\u003e and \u003ca href='https://www.esportsterminal.com/news/5a18522a656a050014470910' target='_blank'\u003eDavid Pei (LA Gladiators)\u003c/a\u003e It gives a pretty good insight into how you can expect the teams to be run from each coach's perspective. We'll be putting out more of these, so stay tuned. \r\n\r\n\u003ch3\u003eARMS\u003c/h3\u003e\r\nARMS recently had the \u003ca href='https://www.esportsterminal.com/news/5a18af31f291df00144b575f' target='_blank'\u003e'Party Crash' event\u003c/a\u003e, which resulted in Spring Man winning with a 68% win over 2nd place Ribbon Girl at 38%. Of course, this was all translated by the beautiful Google Translate from the Japanese ARMS Twitter. \r\n\r\nThere you have it! Stay tuned for new material this week! ","sourceLink":"","image":"https://i.imgur.com/9ncK8FF.png","imageCaption":"Weekly Recap","imageSource":"EST","contentType":"standard","categories":["general","Overwatch League","Street Fighter V","Overwatch","ARMS","Marvel vs. Capcom: Infinite"],"published":{"$date":"2017-11-27T16:48:52.836Z"},"__v":0}
{"_id":{"$oid":"5a1cca0e0e14fc001434f55d"},"author":"Mike Keppler","title":"NuckleDu to Potentially Drop Out of Capcom Cup 2017","subTitle":"The Previous Capcom Cup Champ Dropping Out?","body":"Du Dang, or more commonly known by his handle \"NuckleDu\", has said on Twitter that he most likely will not be attending Capcom Cup 2017.  Here are his exact words on the matter:\r\n\r\n\"I most likely won't be attending Capcom Cup 2017. Talked to Capcom, and they support my decision completely. Waiting to hear back from Team Liquid. I appreciate everyones support throughout the year. Thank you!\"\r\n\r\nIt must be very difficult to make this kind of decision especially when he is considered to be one of the top contenders in the Capcom Cup and the current reigning champion from 2016.  If NuckleDu does end up dropping out of the race, we here at EST would like to thank NuckleDu for a great season two as he has been an absolute blast to watch throughout the year.  We hope everything's okay, dude!","sourceLink":"https://twitter.com/LiquidNuckleDu/status/935265225141555200","image":"https://i.imgur.com/qhPZ2ty.jpg","imageCaption":"The Previous Capcom Cup Champ Dropping Out?","imageSource":"NuckleDu Twitter","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-28T02:29:34.020Z"},"__v":0}
{"_id":{"$oid":"5a1d9cd1daf3dc0014e62d72"},"author":"Nate Chrisman","title":"Breaking down Overwatch 'Path to Pro'","subTitle":"Do you have what it takes? ","body":"The Overwatch League just released an update to their “Road to Pro” path, which is at it’s core an opportunity for top ranked solo queue players to showcase their talents for Overwatch League teams. There is, however, a little more to it. So, here’s the entire process explained in some detail.  \r\n\r\nTo really understand how this process works, we have to define a few different branches of competitive Overwatch, namely Overwatch Contenders, the Open Division, and some other leagues that participate. If you already understand how any one of these works, feel free to skip on to the next section – it all ties together in the end to define the Path to Pro. \r\n\r\n\u003ch3 style='text-align: center;'\u003eOverwatch Open Division (step 1)\u003c/h3\u003e\r\n\u003cimg src='https://i.imgur.com/qBfzNHS.png?1' alt='Overwatch Open Division'\u003e\r\n\r\nOpen Division is where it all starts for players who are currently not involved in Overwatch esports. If you play Overwatch on PC and are eligible to compete in ranked solo queue, then you have the opportunity to participate in this. Once you’ve attained the rank of ‘Master’ or higher (in the most recent season), you’re able to assemble and sign up with team of players who have the same (or higher) ranking or sign up as a free agent (where you’ll proactively need to find a team by a specific deadline). \r\n\r\nIf you’d like more detail on the specifics of the sign up process, how to find a team, etc. you can read their very informative presentation on their site. Otherwise, the gist of this is that there will be teams competing in all 7 regions. Currently, there are 7 weeks of competition, where you’ll play once per week, with an 8 team playoff at the end. The top four teams from each region (that makes 28 teams) will then compete in the Overwatch Contenders Trials.\r\n\r\n\u003ch3 style='text-align: center;'\u003eOverwatch Contenders Trials (step 2)\u003c/h3\u003e\r\n\u003cimg src='https://i.imgur.com/opr1vmM.png?1' alt='Overwatch Contenders Trials'\u003e\r\n\r\nThis is, as said above, is where the top 28 teams across the entire Open Division will face off. The Contender Trials is an 8 team promotion-relegation style tournament. So, eight teams from each region will compete, four of which come from being the top four teams in Open Division in that particular region, but where do the other four come from? Well, they’re going to be chosen from the other existing leagues in the region which are \u003ci\u003enot necessarily\u003c/i\u003e (but can be) from the Open Division. This means that you’ll either move on to the next season of Overwatch Contenders (promotion) or move back to the Open Division/other leagues (relegation). \r\n\r\n\u003ch3 style='text-align: center;'\u003eOverwatch Contenders (step 3)\u003c/h3\u003e\r\n\u003cimg src='https://i.imgur.com/4TKYkiy.png?1' alt='Overwatch Contenders'\u003e\r\n\r\n\u003ca href='https://www.overwatchcontenders.com/en-us/' target='_blank'\u003eOverwatch Contenders\u003c/a\u003e is the highest branch in Overwatch esports you can reach unless you move on to being drafted for an Overwatch League team. It will consist of three seasons. Previously, it was the top 8 teams from each region (there were five last season), but now it is a \u003ci\u003eminimum\u003c/i\u003e of 6 teams from each region (there are now 7). \r\n\r\nIt’s unclear whether the format for Contenders will remain exactly the same, but chances are there will be some changes. This is, however, where the scouts for OWL teams will be watching closely, because if you’ve made it this far, the next step is big time play. \r\n\r\n\u003ch3 style='text-align: center;'\u003ePath to Pro – Bringing It All Together\u003c/h3\u003e\r\n\r\nWhat you see above is each part of the Path to Pro, just broken down a little bit. The name really says it all. It very much so is a path that’s laid out for you to get to top tier competitive Overwatch. This is something that some other sports don’t necessarily have, which is exciting. The pathway is there; you just have to prove yourself. If you can do that, you’ve done most of the battle. So, if you want to be a part of competitive Overwatch on a professional level, there are a few steps to take. \r\n\r\nFirst, do your best in solo queue and obtain a rank of ‘Master’ or higher (easier said than done, right?). Once you’ve done that, register for the Overwatch Open League either as a team with other ‘Master’ rank (or higher) players, or as a free agent. Just be aware that if you register as a free agent, you’ll need to do the footwork for collaborating with others that are also looking for teams. \r\n\r\nIf your team performs well in the Open Division, you will be invited to compete in your region’s Contenders Trials. This is where you and the top teams from other regions will compete for slots in the next season of Overwatch Contenders. Since there are three seasons for Contenders, you have multiple opportunities to make this happen. \r\n\r\nMaking it out of the Contenders Trials, you’ll move on to the actual Overwatch Contenders branch. The competition will heat up at this point to a level where you and your team will absolutely need to perform at your best. All eyes are on you at this point when it comes to Overwatch League scouts. At this level of play, you will be looked at as potential members of one of the Overwatch League teams, so be prepared. \r\n\r\nLastly, if you’ve made it out of Contenders, you’ve made it onto an OWL team and have made it to pro. The journey doesn’t stop here, though! In fact, the Path to Pro is just to get you there. Now, as a pro player, you’re expected to be better than you ever have been, finding your resonance within the Overwatch League. \r\n\r\nSince this is path is open to anyone, that means the competition will be fierce throughout the entire process. Hopefully this is going to be the most efficient way to extract the talent from all over the world, making competitive Overwatch even more exciting to be a part of, whether you’re a spectator, analyst, player, or anything else you might identify with. \r\n\r\nOnce more details on this are released, we’ll be sure to keep you posted. ","sourceLink":"https://overwatchleague.com/en-us/news/21293459","image":"https://i.imgur.com/EzxSpnB.jpg","imageCaption":"A way to make it big!","imageSource":"Overwatch League","contentType":"standard","categories":["general","Overwatch League","Overwatch","Boston Uprising","Dallas Fuel","Florida Mayhem","Houston Outlaws","London Spitfire","Los Angeles Gladiators","Los Angeles Valiant","New York Excelsior","San Francisco Shock","Seoul Dynasty","Shanghai Dragons","Philadelphia Fusion"],"published":{"$date":"2017-11-28T17:28:49.000Z"},"__v":0}
{"_id":{"$oid":"5a1eeeff3562bd0014c78bbe"},"author":"Nate Chrisman","title":"Coach Profile: Beoum-jun ‘Bishop’ Lee (London Spitfire)","subTitle":"A history full of victories","body":"In the Atlantic Division of the Overwatch League resides the London Spitfire. The team, which is a melting pot of Overwatch players from KongDoo, GC Busan, Team Liquid, and Meta Athena, is a 100% South Korean roster which has been assembled in such a way that will leave their opponents with a very small margin of error. \r\n\r\nTheir Head Coach, Beoum-jun ‘Bishop’ Lee has a track record as a player on KongDoo Panthera that clearly shows his competence in the game. After playing for KongDoo Panthera for a few months, Bishop moved on to Cloud 9 as a coach, followed shortly by Cloud 9 actually acquiring the KongDoo Panthera team in September of 2017. After the acquisition, Cloud 9 announced the complete London Spitfire roster, for which Bishop is the Head Coach. \r\n\r\nAs a coach, Bishop has taken Cloud 9’s Overwatch team to the top 8 in Overwatch TaKeOver 2, two separate Overwatch Rumbles, and the CyberPowerPC ’17 EGS Spring Invitational. His most recent placement as Cloud 9’s coach was in Overwatch Contenders Zero: North America, where they placed in the top 12. \r\n\r\nWhen Bishop was playing for KongDoo Panthera, they placed first in Nexus Cup: Halloween, Nexus Cup: Grand Finals, and Masters Gaming Arena: Asian Regional. They competed in the Overwatch APEX: Season 1, where they placed top 12. \r\n\r\nLondon Spitfire starts off the second day of the Overwatch League Preseason by facing off against LA Gladiators. We are excited for a great first match for Spitfire! \r\n\r\nGive Bishop a follow on \u003ca href='https://twitter.com/BishopOW'\u003ehis Twitter!\u003c/a\u003e\r\n\r\nCheck out our \u003ca href='https://www.esportsterminal.com/news/5a18522a656a050014470910'\u003eCoach Profile on LA Gladiator’s Head Coach David Pei\u003c/a\u003e to see what they’re up against. \r\n \r\n","sourceLink":"","image":"https://i.imgur.com/BdDBSIM.png","imageCaption":"Dog Fights - Incoming","imageSource":"London Spitfire","contentType":"standard","categories":["general","Overwatch League","Overwatch","London Spitfire"],"published":{"$date":"2017-11-29T17:31:43.659Z"},"__v":0}
{"_id":{"$oid":"5a1f62c63562bd0014c78bc4"},"author":"Mike Keppler","title":"Official Capcom Cup 2017 Brackets and Details!","subTitle":"Rise Up!","body":"\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/sHKvJ90yjTA\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\n\r\nSome takeaways:\r\n\u003cul\u003e\r\n\u003cli\u003eBest of five throughout the whole tournament\u003c/li\u003e\r\n\u003cli\u003eThere will be two official streams broadcasting the Capcom Cup\u003c/li\u003e\r\n\u003cli\u003eNuckledu has officially resigned from the tournament\u003c/li\u003e\r\n\u003cli\u003eRicki Ortiz will be taking his place at the #31 seed\u003c/li\u003e\r\n\u003cli\u003e#32 seed slot still open for whoever wins the LCQ right before the Capcom Cup\u003c/li\u003e\r\n\u003c/ul\u003e\r\nFull bracket can be found \u003ca href=\"http://challonge.com/dx4ozknw\"\u003ehere!\u003c/a\u003e","sourceLink":"https://www.youtube.com/watch?v=sHKvJ90yjTA","image":"https://i.imgur.com/c2AUNuE.png","imageCaption":"It's Almost Time!","imageSource":"Capcom Fighters","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-11-29T01:45:42.000Z"},"__v":0}
{"_id":{"$oid":"5a1f6a283562bd0014c78bc5"},"author":"Mike Keppler","title":"ARMS 4.1 Update Out Now!","subTitle":"The game that just keeps on giving!","body":"The ARMS 4.1 Update is out right now and here is what our favorite Japanese ARMS twitter account has to say about it (with the help of Google Translate):\r\n\r\n\"New · fighting sports \"ARMS\", Ver.4.1 start distribution!\r\n· Mysterious new fighter \"Spring Toron\" can be used!\r\n· Add badge!\r\n· Other balance adjustment\r\nPlease update and try playing!\"\r\n\r\nSpringtron (or Spring Toron according to the translation) is now available for everybody to play.  He shares the same ARMS unlocks as Springman, so no worries having to start from scratch with him.  Other than that, he has a few differences compared to Springman like releasing a shockwave when his ARMS are fully charged and of course just being bad ass looking.\r\n\r\nOther additions include new badges to unlock and the usual \"balance updates\" to keep things super fresh.  The real question is which update will make the almighty Biff playable?  I guess we'll just have to keep on waiting...\r\n\r\nEnjoy the new update everybody!","sourceLink":"https://twitter.com/ARMS_Cobutter/status/936039633976098816","image":"https://i.imgur.com/dCk8NHg.jpg","imageCaption":"Headshots!","imageSource":"ARMS Twitter","contentType":"standard","categories":["general","ARMS"],"published":{"$date":"2017-11-29T02:17:12.000Z"},"__v":0}
{"_id":{"$oid":"5a2031a2aeffe000144a577c"},"author":"Nate Chrisman","title":"Overwatch boosting controversy gets SADO 6 month ban","subTitle":"No competitive play for half a year. Ouch!","body":"It was known across the Korean ranked ladder that professional Overwatch player Su-Min “SADO” Kim was selling boosting services to lower ranked players in the ladder. Despite this, Philadelphia Fusion still decided to bring him onto the roster. It was, however, unknown how it would be handled now that the OWL infrastructure is in place. It did stir some controversy when people found out he was added to the roster, so much controversy that he was promptly removed from any media that Fusion put out with his name on it. \r\n\r\nThe statement that Overwatch League has put out states:\r\n\r\n “Participating in “account-boosting” schemes, wherein an individual is paid to increase another user’s Skill Rating, is contrary to these values, and violates the Blizzard End User License Agreement. As such, the Overwatch League has chosen to suspend Su-Min “Sado” Kim, of the Philadelphia Fusion, for the preseason and the first 30 matches of the inaugural season.” \r\n\r\nWhich is essentially until May of 2018, effectively a 6 month ban. So it certainly isn’t just a slap on the wrist, but it did seem to take some time to make the decision. Fusion also put out a statement \u003ca href='https://twitter.com/phl_fusion?lang=en'\u003eon their Twitter\u003c/a\u003e saying “The Fusion fully cooperated with the Overwatch League…” and “We apologize for keeping our fans in the dark over the last several weeks, as we did not want to comment until all the facts were discovered.”\r\n\r\nThis is another interesting issue that is unique to esports that we will surely see more of as time goes on, not just within the Overwatch League, but other games as well. Although, it is hard to see how it is worth anything to the players who receive the service as their ability to play at a higher level isn’t substantiated, but to each their own. \r\n\r\nSo if you’ve been wanting to see SADO play, you’re going to have to wait half a year. ","sourceLink":"https://overwatchleague.com/en-us/news/21272981","image":"https://i.imgur.com/ssBdabM.png","imageCaption":"No play for 6 months. SADO got slapped!","imageSource":"Philadelphia Fusion","contentType":"standard","categories":["general","Overwatch League","Overwatch","Philadelphia Fusion"],"published":{"$date":"2017-11-30T16:28:18.000Z"},"__v":0}
{"_id":{"$oid":"5a204aaaaeffe000144a577d"},"author":"Nate Chrisman","title":"ESL Odense rulings affect SK Gaming, Astralis, and Liquid players","subTitle":"Sometimes you just don't make the cut! ","body":"For players who are new to CS:GO teams that are playing in the Pro League Finals, a petition needs to be made to the World Esports Association (WESA), a regulatory organization which is run by ESL. \r\n\r\nThree different teams petitioned for new players to compete along side them in Season 6, which is taking place in Odense next week on December 8th. If any players who are recently transferred to the teams did so prior to this year's deadline of November 10th, they will most likely be eligible to compete barring any other unforeseen circumstances. \r\n\r\nSK Gaming petitioned for Ricardo Prass, also known as 'boltz', to play. Given that he was transferred to the team on November 1st, he will be competing along side SK in Odense. \r\n\r\nAstralis petitioned for two new players, one was granted eligibility and the other was not. An emergency transfer was granted as a result of medical conditions for one of the team's players. The condition for this transfer was that the new player could not have been involved in the last match day of Pro League, which was November 12th. So, Ruben “RUBINO” Villarroel was the choice for this. Unfortunately, Dennis \"dennis\" Edman was not eligible due to the requirement that WESA placed on the emergency transfer. \r\n\r\nTeam Liquid did not fare so well with their request to have Lucas 'steel' Lopes play. Barely missing the deadline by two days, his transfer from Immortals to Liquid on November 12th rendered him ineligible to compete. ","sourceLink":"http://en.pro.eslgaming.com/csgo/proleague/news/player-changes-for-pro-league-season-6-finals/","image":"https://i.imgur.com/r4xUwzp.jpg","imageCaption":"Season 6 is upon us!","imageSource":"ESL Pro League","contentType":"standard","categories":["general","Counter-Strike: Global Offensive"],"published":{"$date":"2017-11-30T18:15:06.472Z"},"__v":0}
{"_id":{"$oid":"5a20645b5e25950014c14cc3"},"author":"Josh Evans","title":"New Marvel vs. Capcom: Infinite Premium Costumes Dropping Soon!","subTitle":"New MvC:I Costumes Incoming","body":"Twelve new Premium Costumes for Marvel vs. Capcom: Infinite have been announced, and they're lookin' fresh. The dozen new costumes will drop December 5th, alongside the new character DLC, which includes the Winter Soldier, Black Widow, and Venom. Check out the new threads in action, highlighted in two themed costume packs, below:\r\n\r\n\u003ciframe src=\"https://www.youtube.com/embed/lcI7WvQxaxs\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\nThe Cosmic Crusaders pack contains Premium Costumes for Rocket Raccoon, Gamora, Nova, X, Zero, and Strider.\r\n\r\n\u003ciframe src=\"https://www.youtube.com/embed/rrrCF4-xov4\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\nStone Seekers contains Premium Costumes for Ultron, Thanos, Spider-Man, Frank West, Haggar, and Jedah.\r\n\r\nYou can purchase the costumes several different ways: 1) Individually, priced at $3.99 a pop. 2) In one of the themed costume packs, priced at $11.99 per pack. 3) The Premium Costume Pass ($29.99), which includes all twelve new costumes, plus the first eighteen that were released prior.\r\n\r\nMy personal favorites out of the new bunch are Gamora's Classic Costume, Nova Prime, Special X, Ultron Conquest, Thanos Annihilation, and Jedah's Makai Messiah. Pictures showcasing each new Premium Costume can be found on Capcom \u003ca href=\"http://www.capcom-unity.com/strumslinger/blog/2017/11/29/a-dangerous-dozen-of-new-premium-costumes-available-december-5-for-marvel-vs-capcom-infinite\"\u003ehere\u003c/a\u003e.","sourceLink":"","image":"https://i.imgur.com/r0R2YGo.png","imageCaption":"X's \"Special X\" MvC:I Premium Costume","imageSource":"Capcom","contentType":"standard","categories":["general","Marvel vs. Capcom: Infinite"],"published":{"$date":"2017-11-30T20:04:43.000Z"},"__v":0}
{"_id":{"$oid":"5a21961f4861370014425a6d"},"author":"Nate Chrisman","title":"Coach Profile: TaiRong (Houston Outlaws)","subTitle":"To lead outlaws, you need to be an outlaw","body":"Do you remember watching the Overwatch World Cup grand finals in 2016 where South Korea went 4-0 against Russia? If you don’t, let me just say that the entire grand finals took just under 50 minutes, so South Korea came and conquered just in time for dinner and drinks afterward. It was almost as if they challenged themselves to get the job done in the shortest amount of time. Well, TaiRong helped greatly in leading South Korea to that victory.    \r\n\r\nTaiRong has been a coach just as long as he’s been playing, it seems. So far he’s coached a few teams including NGA Club, Afreeca Freecs, and now the Houston Outlaws. A lot of his coaching credentials in Overwatch come from this year, in fact, where his teams have landed significant placement in at least 8 tournaments including APAC Premier, Overwatch APEX (Seasons 2, 3, and 4), and the Bigfile Overwatch Battleroyal.\r\n\r\nIn an interview with \u003ca href=\"http://bit.ly/2AkK2KL\"\u003eInvenGlobal\u003c/a\u003e, he was asked his criteria for recruiting players and what he values the most. This was his response: \r\n\r\n\u003chr\u003e\r\n“I can quickly tell if a player has good game sense and is a good FPS player. It should be noted being a good FPS player does not necessarily translate to being a good Overwatch player. This is the fastest paced competitive FPS out on the market. Making correct decisions speedily is imperative.\r\n\r\nWhat I value the most in a player is responsibility. Players can always improve as long as they feel responsible for their level of play. It is hard for an irresponsible player to make progress.”\r\n\u003chr\u003e\r\n\r\nAlmost surely his philosophy is the same when speaking of the Outlaws. Player responsibility is absolutely crucial for any team to perform at their maximum. So it looks like TaiRong has a clear idea of how to utilize that trait in each player to ensure that they improve on an individual basis, which will clearly benefit the team as a whole.\r\n  \r\nThe first match for Houston Outlaws in the Overwatch Preseason is \u003ca href='https://www.esportsterminal.com/events/5a0bacf5cb23210014afe0e0'\u003eon December 7th\u003c/a\u003e, facing off in a good ol’ fashioned duel against the Fuel. How will they fare? We’ll just have to wait and see!","sourceLink":"","image":"https://i.imgur.com/6vCZkda.png","imageCaption":"TaiRong (3rd from left) with Team South Korea","imageSource":"Blizzard Entertainment","contentType":"standard","categories":["general","Overwatch League","Overwatch","Houston Outlaws"],"published":{"$date":"2017-12-01T17:49:19.000Z"},"__v":0}
{"_id":{"$oid":"5a21c7444861370014425a6e"},"author":"Nate Chrisman","title":"Ghost Gaming possibly to replace Immortals in ESL Pro League ","subTitle":"Will they be eligible? Only ESL will tell!","body":"Earlier in November we learned of the roster transfer of Lucas 'steel' Lopes from Immortals to Team Liquid. Now as we go into the Pro League Season 6, Immortals is dropping out as a result of “experiencing roster instability,” said CEO Noah Whinston, “due to factors outside of the organization’s control.” \r\n\r\nThis leaves Immortals completely removed from the Season 6 standings and a wide open spot for the Pro League to be filled. According to ESL, Ghost Gaming has been offered the spot to replace Immortals barring any unforeseen conditions of ineligibility. \r\n\r\nGhost Gaming is fairly new to CS:GO, only starting to compete earlier this year in April 2017, but they do have quite the reputation in competitive Gears of War, CoD, Rocket League, and PLAYERUNKNOWN’S BATTLEGROUNDS. The team has had mixed results since it’s inception, however, revamping the roster a couple of times already. \r\n\r\nOver the past few months, they have competed in ESL One: Cologne, ELEAGUE CS:GO Premier, Dreamhack Denver, Dreamhack Winter, and of course the ESL Pro League. Placement in these tournaments has been mixed, largely as a result of the constant roster changes. As for the most recent regular season of ESL Pro League, they placed last. \r\n\r\nAs we are still awaiting the results of eligibility for the team from ESL as well as the team’s official confirmation, more updates are to come. ","sourceLink":"http://en.pro.eslgaming.com/csgo/proleague/news/immortals-leave-pro-league/","image":"https://i.imgur.com/iqNirW1.jpg","imageCaption":"Will they accept?","imageSource":"ESL","contentType":"standard","categories":["general","Counter-Strike: Global Offensive"],"published":{"$date":"2017-12-01T21:19:00.000Z"},"__v":0}
{"_id":{"$oid":"5a22dec1fb12010014153abf"},"author":"Nate Chrisman","title":"Prophecy couldn't foresee Envy's crushing SFV victory","subTitle":"Not so prophetic, I guess","body":"For their first ever title in fighting game esports, Team Envy wins the Gfinity Esports Elite Series!  Prophecy took a heavy loss in a crushing 4-0 match. The final match was Envy’s Mr. Crimson as Dhalsim against Shivyuken as Laura, an interesting matchup to say the least! Shivryuken performed well by managing the zoning techniques of Dhalsim, but Mr. Crimson didn’t crack under the pressure and ended up giving Laura a few lessons in what can happen when you wake the fight in the pacifist yogi.   \r\n\r\n\u003ca href='https://teamenvyus.com/#'\u003eTeam Envy\u003c/a\u003e has quite the roster and a lot of authority in esports, having been around since 2007. They have very competitive rosters in Call of Duty, Rocket League, League of Legends, Halo, and CS:GO, and are also behind the Overwatch League franchise \u003ca href='https://www.esportsterminal.com/overwatch-league/team/5a08d07cca7498122f04c0b3'\u003eDallas Fuel\u003c/a\u003e. However, they have just ventured into fighting games as of late, making the title victory that much sweeter.\r\n\r\n\u003chr\u003e\r\n\u003cimg src='https://i.imgur.com/9eVZVmf.png' alt='Finals Ranking Envy'\u003e\r\n\u003chr\u003e\r\n\r\nSo, our hats go off to Team Envy for really nailing down this victory and making sure that their names are engraved in the \u003ca href='https://www.gfinityesports.com/uk/'\u003eGfinity Esports Elite Series!\u003c/a\u003e We’re excited to see what more is to come for these players. ","sourceLink":"","image":"https://i.imgur.com/uDyEtzO.png","imageCaption":"The fighters to be Envied! ","imageSource":"Gfinity  Esports","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-12-02T17:11:29.289Z"},"__v":0}
{"_id":{"$oid":"5a235a19df30cf0014d4d92a"},"author":"Mike Keppler","title":"GRPT Infiltration has a New Main!","subTitle":"Juri dropped by GRPT Infiltration for the fortune-telling Menat!","body":"Infiltration, one of the top players entering the LCQ for a chance at the Capcom Cup next weekend has changed his main!  Representing Juri for a majority of season two, it looks like Infiltration will be replacing her with everybody's favorite new waifu, Menat.  I think this makes the most sense given Juri is not really where she needs to be at in terms of balance (high hopes for season three!).  The prospect of a potential Juri main making it into the Capcom Cup would've made me giddy with excitement, but Juri is just up against a giant brick wall so it would be much better if she was set aside for the time being.\r\n\r\nEnter Menat!  Infiltration will have an advantage going into the LCQ this following week since nobody has played against his Menat in a tournament setting.  Players who face him are going to have to do a lot of strategy readjustment to keep up with the solid Menat that Infiltration is bringing to the table.  Take a look at the video below to see the power of Menat in the hands of somebody as highly regarded as Infiltration.\r\n\r\n\u003ciframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Xahn-J3JUS8\" frameborder=\"0\" allowfullscreen\u003e\u003c/iframe\u003e\r\n\r\nInfiltration was the top pick to win Capcom Cup 2016, but unfortunately was eliminated right at the start of the tournament.  Hopefully Menat will bring better fortune to the old king of Street Fighter V!","sourceLink":"https://www.youtube.com/watch?v=Xahn-J3JUS8","image":"https://i.imgur.com/gggRLpX.jpg","imageCaption":"Will Menat be Infiltration's answer to securing the final spot for Capcom Cup 2017?","imageSource":"Capcom","contentType":"standard","categories":["general","Street Fighter V"],"published":{"$date":"2017-12-03T01:57:45.093Z"},"__v":0}
{"_id":{"$oid":"5a242ba7df30cf0014d4d92b"},"author":"Nate Chrisman","title":"We now know everyone who's competing in Battle for the Stones!","subTitle":"Battling for Special Rocks","body":"Marvel vs. Capcom: Infinite’s Battle for the Stones finals are upon us! Just yesterday, the final qualifying tournament has finished, which means we now know the (un)official brackets for the finals this week. Michael Martin, Capcom’s Esports Social Media Manager, has tweeted the list of players that will supposedly be on the official brackets. \r\n\r\nThe Battle for the Stones finals consists of the top 16 players, comprised of seven previous EVO champions, six Infinity Stone bearers (from Infinity Stone tournaments around the globe), and three online winners (one from the EU, LA, and NA qualifying tournaments). \r\n\r\n\u003ch3\u003eEVO Champs\u003c/h3\u003e\r\n\r\nViscant\r\nFChamp\r\nFlocker\r\nJWong\r\nKBR\r\nChrisG\r\nRyanLV\r\n\r\n\u003ch3\u003eInfinity Stone Bearers\u003c/h3\u003e\r\n\r\nSacktap (Space)\r\nRichard Nguyen (Soul)\r\nKazunoko (Time)\r\nCloud805 (Power)\r\nTeemo (Mind)\r\nBrian Kasugano (Reality)\r\n\r\n\u003ch3\u003eOnline Qualifiers\u003c/h3\u003e\r\n\r\nAlioune (EU)\r\nMoise (LA)\r\nStealth (NA)\r\n\r\nDuring the Capcom Cup/PSX event in Anaheim this coming weekend is when the finals will take place. There is (of course) a one-of-a-kind trophy for the winner! So, you’ll have to set one eye on the Capcom Cup stream and the other eye on the Battle for the Stones stream! Get ready for some solid MVCi action this weekend!   \r\n","sourceLink":"https://twitter.com/Bizarro_Mike/status/937161935648260096","image":"https://i.imgur.com/vOfvyva.png","imageCaption":"Battling for special rocks","imageSource":"Marvel vs. Capcom","contentType":"standard","categories":["general","Marvel vs. Capcom: Infinite"],"published":{"$date":"2017-12-03T16:51:51.159Z"},"__v":0}
{"_id":{"$oid":"5a244ad7df30cf0014d4d92c"},"author":"Nate Chrisman","title":"Team Liquid steals Stacked's soul in Dreamhack Winter Quake Finals","subTitle":"The best defense was not good offense in this case","body":"Team Liquid faced off against Stacked for the Quake Champions: Sacrifice Grand Finals. Over three maps, Liquid left Stacked with hardly no room to breathe, taking home the 3-0 victory and the championship winnings. Both teams are clearly top tier, but Stacked just didn’t have enough to overtake Liquid in almost every aspect of the game. \r\n\r\nWhile Stacked certainly had their strategies using brute force to claim the soul and capture the obelisks, Liquid had the cohesiveness which allowed them the adaptability to defend against Stacked in almost any situation. That isn’t to say that Stacked performed badly, however, but failing to match the level of play that Liquid was demanding in order to keep them on their toes was not being delivered. \r\n\r\nFor each of the rounds, the soul was certainly changing hands a lot, which is what one would expect from a Sacrifice match. This volleying of the soul is definitely part of where the intensity of these matches comes in, but the ability to defend the obelisk once the soul is captured is really where the heat is. \r\n\r\nAs said above, in all of the matches, Stacked had strategies that involved a lot of brute force, which were effective in some situations. This allowed Stacked to obtain the soul from Liquid on many occasions. When they captured the soul, however, is where the brute force method failed to keep them afloat.\r\n\r\nWhen defending the obelisk, Liquid was almost always in a complete defensive position, which would require monstrous effort and coordination for any team to break down. Stacked’s strategies did end up eventually working on some level, but they were always breaking through after Liquid had already gained a substantial lead, making Stacked work much harder to defend their capture. As Stacked was defending their obelisk, the fruits of their defensive labor were not ripe, as the usual gain for Stacked was only a few percent before it was stolen again.  \r\n\r\nEven given the beating that Stacked took in the finals, they deserve a massive amount of recognition as they wouldn’t have made it to the finals without top level play. As far as being in the grand finals of any Quake Championship, it’s been a while for them as it has for a lot of other Quake teams. It’s amazing to see the Quake community stay as alive as it is now and the response to Quake Champions is fantastic. Much respect to all of the teams competing in this championship, to the grand finalists, and a big congratulations to Team Liquid for their victory!\r\n\r\nSee the top 3 plays from the Grand Finals \u003ca href='https://twitter.com/DreamHackQuake/status/937389714935394304'\u003ehere!\u003c/a\u003e","sourceLink":"","image":"https://i.imgur.com/mXNcaTp.png","imageCaption":"That's one big trophy!","imageSource":"Dreamhack Quake Twitter","contentType":"standard","categories":["general","Quake"],"published":{"$date":"2017-12-03T19:04:55.087Z"},"__v":0}
